; ModuleID = 'graph'
source_filename = "graph.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.265 = type { i64, ptr }
%__math_v2.234 = type { float, float }
%slice.264 = type { i64, ptr }
%__mem_Allocator.222 = type { ptr, ptr, ptr }
%slice.263 = type { i64, ptr }
%__math_v3.235 = type { float, float, float }

@__main_WIDTH = external global i32
@__main_HEIGHT = external global i32
@__main_vert_shader = external global ptr
@__main_frag_shader = external global ptr
@__sdl_INIT_AUDIO = external global i32
@__sdl_INIT_VIDEO = external global i32
@__sdl_INIT_JOYSTICK = external global i32
@__sdl_INIT_HAPTIC = external global i32
@__sdl_INIT_GAMEPAD = external global i32
@__sdl_INIT_EVENTS = external global i32
@__sdl_INIT_SENSOR = external global i32
@__sdl_INIT_CAMERA = external global i32
@__sdl_WINDOW_FULLSCREEN = external global i64
@__sdl_WINDOW_OPENGL = external global i64
@__sdl_WINDOW_OCCLUDED = external global i64
@__sdl_WINDOW_HIDDEN = external global i64
@__sdl_WINDOW_BORDERLESS = external global i64
@__sdl_WINDOW_RESIZABLE = external global i64
@__sdl_WINDOW_MINIMIZED = external global i64
@__sdl_WINDOW_MAXIMIZED = external global i64
@__sdl_WINDOW_MOUSE_GRABBED = external global i64
@__sdl_WINDOW_INPUT_FOCUS = external global i64
@__sdl_WINDOW_MOUSE_FOCUS = external global i64
@__sdl_WINDOW_EXTERNAL = external global i64

!26 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!27 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!28 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!29 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!30 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!31 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!32 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!33 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!34 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!35 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !1, file: !1, size: 32, align: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43, !44}
!38 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!43 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!44 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !1, file: !1, size: 32, align: 32, elements: !46)
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !1, file: !1, size: 64, align: 64, elements: !51)
!51 = !{!52, !53}
!52 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !1, file: !1, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61}
!56 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!61 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !1, file: !1, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68}
!64 = !DIEnumerator(name: "FIRST", value: 0)
!65 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!66 = !DIEnumerator(name: "MOUSE_MOTION", value: 1024, isUnsigned: true)
!67 = !DIEnumerator(name: "MOUSE_BUTTON_DOWN", value: 1025, isUnsigned: true)
!68 = !DIEnumerator(name: "MOUSE_BUTTON_UP", value: 1026, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_GLattr", scope: !1, file: !1, size: 32, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!71 = !DIEnumerator(name: "RED_SIZE", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "GREEN_SIZE", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "BLUE_SIZE", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "ALPHA_SIZE", value: 3, isUnsigned: true)
!75 = !DIEnumerator(name: "BUFFER_SIZE", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "DOUBLEBUFFER", value: 5, isUnsigned: true)
!77 = !DIEnumerator(name: "DEPTH_SIZE", value: 6, isUnsigned: true)
!78 = !DIEnumerator(name: "STENCIL_SIZE", value: 7, isUnsigned: true)
!79 = !DIEnumerator(name: "ACCUM_RED_SIZE", value: 8, isUnsigned: true)
!80 = !DIEnumerator(name: "ACCUM_GREEN_SIZE", value: 9, isUnsigned: true)
!81 = !DIEnumerator(name: "ACCUM_BLUE_SIZE", value: 10, isUnsigned: true)
!82 = !DIEnumerator(name: "ACCUM_ALPHA_SIZE", value: 11, isUnsigned: true)
!83 = !DIEnumerator(name: "STEREO", value: 12, isUnsigned: true)
!84 = !DIEnumerator(name: "MULTISAMPLEBUFFERS", value: 13, isUnsigned: true)
!85 = !DIEnumerator(name: "MULTISAMPLESAMPLES", value: 14, isUnsigned: true)
!86 = !DIEnumerator(name: "ACCELERATED_VISUAL", value: 15, isUnsigned: true)
!87 = !DIEnumerator(name: "RETAINED_BACKING", value: 16, isUnsigned: true)
!88 = !DIEnumerator(name: "CONTEXT_MAJOR_VERSION", value: 17, isUnsigned: true)
!89 = !DIEnumerator(name: "CONTEXT_MINOR_VERSION", value: 18, isUnsigned: true)
!90 = !DIEnumerator(name: "CONTEXT_FLAGS", value: 19, isUnsigned: true)
!91 = !DIEnumerator(name: "CONTEXT_PROFILE_MASK", value: 20, isUnsigned: true)
!92 = !DIEnumerator(name: "SHARE_WITH_CURRENT_CONTEXT", value: 21, isUnsigned: true)
!93 = !DIEnumerator(name: "FRAMEBUFFER_SRGB_CAPABLE", value: 22, isUnsigned: true)
!94 = !DIEnumerator(name: "CONTEXT_RELEASE_BEHAVIOR", value: 23, isUnsigned: true)
!95 = !DIEnumerator(name: "CONTEXT_RESET_NOTIFICATION", value: 24, isUnsigned: true)
!96 = !DIEnumerator(name: "CONTEXT_NO_ERROR", value: 25, isUnsigned: true)
!97 = !DIEnumerator(name: "FLOATBUFFERS", value: 26, isUnsigned: true)
!98 = !DIEnumerator(name: "EGL_PLATFORM", value: 27, isUnsigned: true)
!99 = !{i32 2, !"CodeView", i32 1}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = distinct !DISubprogram(name: "map_point", linkageName: "__graph_map_point", scope: !1, file: !1, line: 9, type: !102, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !109)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !104, !107, !107}
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "__math_v2", scope: !1, file: !1, size: 64, elements: !105)
!105 = !{!106, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1, file: !1, baseType: !107, size: 32, align: 32)
!107 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1, file: !1, baseType: !107, size: 32, align: 32, offset: 32)
!109 = !{}
!110 = !DILocation(line: 9, scope: !101)
!111 = !DILocalVariable(name: "p", scope: !101, file: !1, line: 9, type: !104)
!112 = !DILocalVariable(name: "x_end", arg: 1, scope: !101, file: !1, line: 9, type: !107)
!113 = !DILocalVariable(name: "y_end", arg: 2, scope: !101, file: !1, line: 9, type: !107)
!114 = !DILocation(line: 10, scope: !101)
!115 = !DILocalVariable(name: "X", scope: !101, file: !1, line: 10, type: !107)
!116 = !DILocation(line: 11, scope: !101)
!117 = !DILocalVariable(name: "Y", scope: !101, file: !1, line: 11, type: !107)
!118 = !DILocation(line: 12, scope: !101)
!119 = distinct !DISubprogram(name: "calculate_spline", linkageName: "__graph_calculate_spline", scope: !1, file: !1, line: 18, type: !120, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !109)
!120 = !DISubroutineType(types: !121)
!121 = !{!104, !104, !104, !104, !104, !107}
!122 = !DILocation(line: 18, scope: !119)
!123 = !DILocalVariable(name: "p0", scope: !119, file: !1, line: 18, type: !104)
!124 = !DILocalVariable(name: "p1", arg: 1, scope: !119, file: !1, line: 18, type: !104)
!125 = !DILocalVariable(name: "p2", arg: 2, scope: !119, file: !1, line: 18, type: !104)
!126 = !DILocalVariable(name: "p3", arg: 3, scope: !119, file: !1, line: 18, type: !104)
!127 = !DILocalVariable(name: "t", arg: 4, scope: !119, file: !1, line: 18, type: !107)
!128 = !DILocation(line: 20, scope: !119)
!129 = !DILocalVariable(name: "tt", scope: !119, file: !1, line: 20, type: !107)
!130 = !DILocation(line: 21, scope: !119)
!131 = !DILocalVariable(name: "ttt", scope: !119, file: !1, line: 21, type: !107)
!132 = !DILocation(line: 22, scope: !119)
!133 = !DILocalVariable(name: "q0", scope: !119, file: !1, line: 22, type: !107)
!134 = !DILocation(line: 23, scope: !119)
!135 = !DILocalVariable(name: "q1", scope: !119, file: !1, line: 23, type: !107)
!136 = !DILocation(line: 24, scope: !119)
!137 = !DILocalVariable(name: "q2", scope: !119, file: !1, line: 24, type: !107)
!138 = !DILocation(line: 25, scope: !119)
!139 = !DILocalVariable(name: "q3", scope: !119, file: !1, line: 25, type: !107)
!140 = !DILocation(line: 30, scope: !119)
!141 = !DILocalVariable(name: "x", scope: !119, file: !1, line: 30, type: !107)
!142 = !DILocation(line: 31, scope: !119)
!143 = !DILocalVariable(name: "y", scope: !119, file: !1, line: 31, type: !107)
!144 = !DILocation(line: 32, scope: !119)
!145 = distinct !DISubprogram(name: "draw", linkageName: "__graph_draw", scope: !1, file: !1, line: 35, type: !146, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !109)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !148, !155, !107, !107}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__renderer_ctx", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "__renderer_ctx", scope: !150, file: !150, size: 64, elements: !151)
!150 = !DIFile(filename: "renderer.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "vao", scope: !150, file: !150, baseType: !153, size: 32, align: 32)
!153 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "vbo", scope: !150, file: !150, baseType: !153, size: 32, align: 32, offset: 32)
!155 = !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !156, size: 128, align: 64, elements: !157)
!156 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !156, file: !156, baseType: !159, size: 64, align: 64)
!159 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !156, baseType: !161, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__math_v2", baseType: !162, size: 64, align: 64, dwarfAddressSpace: 0)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "__math_v2", scope: !156, file: !156, size: 64, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !156, file: !156, baseType: !107, size: 32, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !156, file: !156, baseType: !107, size: 32, align: 32, offset: 32)
!166 = !DILocation(line: 35, scope: !145)
!167 = !DILocalVariable(name: "renderer", scope: !145, file: !1, line: 35, type: !148)
!168 = !DILocalVariable(name: "points", arg: 1, scope: !145, file: !1, line: 35, type: !155)
!169 = !DILocalVariable(name: "x_end", arg: 2, scope: !145, file: !1, line: 35, type: !107)
!170 = !DILocalVariable(name: "y_end", arg: 3, scope: !145, file: !1, line: 35, type: !107)
!171 = !DILocation(line: 36, scope: !145)
!172 = !DILocation(line: 37, scope: !145)
!173 = !DILocation(line: 39, scope: !145)
!174 = !DILocalVariable(name: "scratch", scope: !145, file: !1, line: 39, type: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !1, file: !1, size: 192, elements: !176)
!176 = !{!177, !184, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1, file: !1, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(int, *__mem_Allocator) -> ?*", baseType: !179, size: 64, align: 64, dwarfAddressSpace: 0)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !159, !182}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*void", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__mem_Allocator", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !156, file: !156, size: 192, align: 64, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1, file: !1, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(*, *__mem_Allocator)", baseType: !186, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !181, !182}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1, file: !1, baseType: !181, size: 64, align: 64, offset: 128)
!189 = !DILocation(line: 42, scope: !145)
!190 = !DILocalVariable(name: "verts", scope: !145, file: !1, line: 42, type: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, scope: !150, file: !150, size: 128, align: 64, elements: !192)
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !150, file: !150, baseType: !159, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !150, file: !150, baseType: !195, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__math_v3", baseType: !196, size: 64, align: 64, dwarfAddressSpace: 0)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "__math_v3", scope: !150, file: !150, size: 96, elements: !197)
!197 = !{!198, !199, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !150, file: !150, baseType: !107, size: 32, align: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !150, file: !150, baseType: !107, size: 32, align: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !150, file: !150, baseType: !107, size: 32, align: 32, offset: 64)
!201 = !DILocation(line: 44, scope: !145)
!202 = !DILocalVariable(name: "i", scope: !145, file: !1, line: 44, type: !159)
!203 = !DILocation(line: 45, scope: !145)
!204 = !DILocalVariable(name: "p0", scope: !145, file: !1, line: 45, type: !104)
!205 = !DILocation(line: 46, scope: !145)
!206 = !DILocalVariable(name: "p1", scope: !145, file: !1, line: 46, type: !104)
!207 = !DILocation(line: 47, scope: !145)
!208 = !DILocalVariable(name: "p2", scope: !145, file: !1, line: 47, type: !104)
!209 = !DILocation(line: 48, scope: !145)
!210 = !DILocalVariable(name: "p3", scope: !145, file: !1, line: 48, type: !104)
!211 = !DILocation(line: 50, scope: !145)
!212 = !DILocalVariable(name: "t", scope: !145, file: !1, line: 50, type: !107)
!213 = !DILocation(line: 51, scope: !145)
!214 = !DILocalVariable(name: "point", scope: !145, file: !1, line: 51, type: !104)
!215 = !DILocation(line: 52, scope: !145)
!216 = !DILocation(line: 58, scope: !145)
!217 = !DILocation(line: 40, scope: !145)
!218 = !DILocation(line: 59, scope: !145)
