; ModuleID = 'init'
source_filename = "init.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.392 = type { i64, ptr }
%__init_TypeInfo.345 = type { i64, %__init_TypeUnion.344 }
%__init_TypeUnion.344 = type { %__init_StructType.336 }
%__init_StructType.336 = type { %slice.387, %string.332, i32 }
%slice.387 = type { i64, ptr }
%string.332 = type { ptr, i64 }
%__init_StructMember.335 = type { %string.332, i64 }
%__init_BasicType.334 = type { i64, i32, i32, %string.332 }
%__init_PointerType.338 = type { i64, i1 }
%__init_EnumType.341 = type { %string.332, %slice.389, i64 }
%slice.389 = type { i64, ptr }
%__init_FunctionType.337 = type { i64, %slice.388 }
%slice.388 = type { i64, ptr }
%__init_ArrayType.339 = type { i64, i32 }

$__init_INVALID_TYPE = comdat nodeduplicate

$__init_type_table = comdat nodeduplicate

$___asan_gen__anon_global = comdat nodeduplicate

$___asan_gen__anon_global.1025 = comdat nodeduplicate

$___asan_gen__anon_global.1027 = comdat nodeduplicate

$___asan_gen__anon_global.1029 = comdat nodeduplicate

$___asan_gen__anon_global.1031 = comdat nodeduplicate

$___asan_gen__anon_global.1033 = comdat nodeduplicate

$___asan_gen__anon_global.1035 = comdat nodeduplicate

$___asan_gen__anon_global.1037 = comdat nodeduplicate

$___asan_gen__anon_global.1039 = comdat nodeduplicate

$___asan_gen__anon_global.1041 = comdat nodeduplicate


!718 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!719 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!720 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!721 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!722 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!723 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !680, file: !680, size: 32, align: 32, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!727 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!728 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !680, file: !680, size: 64, align: 64, elements: !730)
!730 = !{!731, !732}
!731 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!732 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !680, file: !680, size: 32, align: 32, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740}
!735 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!736 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!737 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!738 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!739 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!740 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !680, file: !680, size: 32, align: 32, elements: !742)
!742 = !{!743, !744, !745, !746, !747}
!743 = !DIEnumerator(name: "FIRST", value: 0)
!744 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!745 = !DIEnumerator(name: "MOUSE_MOTION", value: 1024, isUnsigned: true)
!746 = !DIEnumerator(name: "MOUSE_BUTTON_DOWN", value: 1025, isUnsigned: true)
!747 = !DIEnumerator(name: "MOUSE_BUTTON_UP", value: 1026, isUnsigned: true)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_GLattr", scope: !680, file: !680, size: 32, align: 32, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!750 = !DIEnumerator(name: "RED_SIZE", value: 0, isUnsigned: true)
!751 = !DIEnumerator(name: "GREEN_SIZE", value: 1, isUnsigned: true)
!752 = !DIEnumerator(name: "BLUE_SIZE", value: 2, isUnsigned: true)
!753 = !DIEnumerator(name: "ALPHA_SIZE", value: 3, isUnsigned: true)
!754 = !DIEnumerator(name: "BUFFER_SIZE", value: 4, isUnsigned: true)
!755 = !DIEnumerator(name: "DOUBLEBUFFER", value: 5, isUnsigned: true)
!756 = !DIEnumerator(name: "DEPTH_SIZE", value: 6, isUnsigned: true)
!757 = !DIEnumerator(name: "STENCIL_SIZE", value: 7, isUnsigned: true)
!758 = !DIEnumerator(name: "ACCUM_RED_SIZE", value: 8, isUnsigned: true)
!759 = !DIEnumerator(name: "ACCUM_GREEN_SIZE", value: 9, isUnsigned: true)
!760 = !DIEnumerator(name: "ACCUM_BLUE_SIZE", value: 10, isUnsigned: true)
!761 = !DIEnumerator(name: "ACCUM_ALPHA_SIZE", value: 11, isUnsigned: true)
!762 = !DIEnumerator(name: "STEREO", value: 12, isUnsigned: true)
!763 = !DIEnumerator(name: "MULTISAMPLEBUFFERS", value: 13, isUnsigned: true)
!764 = !DIEnumerator(name: "MULTISAMPLESAMPLES", value: 14, isUnsigned: true)
!765 = !DIEnumerator(name: "ACCELERATED_VISUAL", value: 15, isUnsigned: true)
!766 = !DIEnumerator(name: "RETAINED_BACKING", value: 16, isUnsigned: true)
!767 = !DIEnumerator(name: "CONTEXT_MAJOR_VERSION", value: 17, isUnsigned: true)
!768 = !DIEnumerator(name: "CONTEXT_MINOR_VERSION", value: 18, isUnsigned: true)
!769 = !DIEnumerator(name: "CONTEXT_FLAGS", value: 19, isUnsigned: true)
!770 = !DIEnumerator(name: "CONTEXT_PROFILE_MASK", value: 20, isUnsigned: true)
!771 = !DIEnumerator(name: "SHARE_WITH_CURRENT_CONTEXT", value: 21, isUnsigned: true)
!772 = !DIEnumerator(name: "FRAMEBUFFER_SRGB_CAPABLE", value: 22, isUnsigned: true)
!773 = !DIEnumerator(name: "CONTEXT_RELEASE_BEHAVIOR", value: 23, isUnsigned: true)
!774 = !DIEnumerator(name: "CONTEXT_RESET_NOTIFICATION", value: 24, isUnsigned: true)
!775 = !DIEnumerator(name: "CONTEXT_NO_ERROR", value: 25, isUnsigned: true)
!776 = !DIEnumerator(name: "FLOATBUFFERS", value: 26, isUnsigned: true)
!777 = !DIEnumerator(name: "EGL_PLATFORM", value: 27, isUnsigned: true)
!778 = !{i32 2, !"CodeView", i32 1}
!779 = !{i32 2, !"Debug Info Version", i32 3}
!780 = distinct !DISubprogram(name: "get_struct_alignment", linkageName: "__init_get_struct_alignment", scope: !680, file: !680, line: 155, type: !781, spFlags: DISPFlagDefinition, unit: !679, retainedNodes: !785)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !784}
!783 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!784 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!785 = !{}
!786 = !DILocation(line: 155, scope: !780)
!787 = !DILocalVariable(name: "st", scope: !780, file: !680, line: 155, type: !784)
!788 = !DILocation(line: 156, scope: !780)
!789 = !DILocalVariable(name: "t", scope: !780, file: !680, line: 156, type: !790)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !680, file: !680, size: 320, elements: !791)
!791 = !{!792, !809, !810}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !680, file: !680, baseType: !793, size: 128, align: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !794, size: 128, align: 64, elements: !795)
!794 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !794, file: !794, baseType: !783, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !794, file: !794, baseType: !798, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !799, size: 64, align: 64, dwarfAddressSpace: 0)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !794, file: !794, size: 192, elements: !800)
!800 = !{!801, !808}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !794, baseType: !802, size: 128, align: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !794, file: !794, size: 128, elements: !803)
!803 = !{!804, !807}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !794, file: !794, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !806, size: 64, align: 64, dwarfAddressSpace: 0)
!806 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !794, file: !794, baseType: !783, size: 64, align: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !794, file: !794, baseType: !784, size: 64, align: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !680, baseType: !802, size: 128, align: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !680, file: !680, baseType: !811, size: 32, align: 32, offset: 256)
!811 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!812 = !DILocation(line: 157, scope: !780)
!813 = !DILocation(line: 158, scope: !780)
!814 = !DILocation(line: 160, scope: !780)
!815 = !DILocalVariable(name: "biggest", scope: !780, file: !680, line: 160, type: !783)
!816 = !DILocation(line: 161, scope: !780)
!817 = !DILocalVariable(name: "align", scope: !780, file: !680, line: 161, type: !783)
!818 = !DILocation(line: 162, scope: !780)
!819 = !DILocalVariable(name: "m", scope: !780, file: !680, line: 162, type: !820)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !680, file: !680, size: 192, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !680, baseType: !802, size: 128, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !680, file: !680, baseType: !784, size: 64, align: 64, offset: 128)
!824 = !DILocalVariable(name: "i", scope: !780, file: !680, line: 162, type: !783)
!825 = !DILocation(line: 163, scope: !780)
!826 = !DILocalVariable(name: "size", scope: !780, file: !680, line: 163, type: !783)
!827 = !DILocation(line: 164, scope: !780)
!828 = !DILocation(line: 165, scope: !780)
!829 = !DILocation(line: 166, scope: !780)
!830 = !DILocation(line: 170, scope: !780)
!831 = distinct !DISubprogram(name: "get_type_alignment", linkageName: "__init_get_type_alignment", scope: !680, file: !680, line: 173, type: !781, spFlags: DISPFlagDefinition, unit: !679, retainedNodes: !785)
!832 = !DILocation(line: 173, scope: !831)
!833 = !DILocalVariable(name: "t", scope: !831, file: !680, line: 173, type: !784)
!834 = !DILocation(line: 174, scope: !831)
!835 = !DILocalVariable(name: "ti", scope: !831, file: !680, line: 174, type: !836)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !680, file: !680, size: 384, elements: !837)
!837 = !{!838, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !680, file: !680, baseType: !839, size: 64, align: 64)
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !794, file: !794, size: 64, align: 64, elements: !683)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !680, file: !680, baseType: !841, size: 320, align: 64, offset: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !680, file: !680, size: 320, elements: !842)
!842 = !{!843, !850, !851, !860, !866, !871, !874, !883, !889}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !680, file: !680, baseType: !844, size: 256, align: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !680, file: !680, size: 256, elements: !845)
!845 = !{!846, !848, !849, !809}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !680, file: !680, baseType: !847, size: 64, align: 64)
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !794, file: !794, size: 64, align: 64, elements: !695)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !680, file: !680, baseType: !811, size: 32, align: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !680, file: !680, baseType: !811, size: 32, align: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !680, file: !680, baseType: !790, size: 320, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !680, file: !680, baseType: !852, size: 192, align: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !680, file: !680, size: 192, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !680, file: !680, baseType: !784, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !680, file: !680, baseType: !856, size: 128, align: 64, offset: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !794, size: 128, align: 64, elements: !857)
!857 = !{!796, !858}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !794, file: !794, baseType: !859, size: 64, align: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !784, size: 64, align: 64, dwarfAddressSpace: 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !680, file: !680, baseType: !861, size: 128, align: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !680, file: !680, size: 128, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !680, file: !680, baseType: !784, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !680, file: !680, baseType: !865, size: 8, align: 8, offset: 64)
!865 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !680, file: !680, baseType: !867, size: 128, align: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !680, file: !680, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !680, file: !680, baseType: !784, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !680, file: !680, baseType: !811, size: 32, align: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !680, file: !680, baseType: !872, size: 64, align: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !680, file: !680, size: 64, elements: !873)
!873 = !{!869}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !680, file: !680, baseType: !875, size: 320, align: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !680, file: !680, size: 320, elements: !876)
!876 = !{!822, !877, !882}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !680, file: !680, baseType: !878, size: 128, align: 64, offset: 128)
!878 = !DICompositeType(tag: DW_TAG_structure_type, scope: !794, file: !794, size: 128, align: 64, elements: !879)
!879 = !{!796, !880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !794, file: !794, baseType: !881, size: 64, align: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !802, size: 64, align: 64, dwarfAddressSpace: 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !680, file: !680, baseType: !784, size: 64, align: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !680, file: !680, baseType: !884, size: 128, align: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !680, file: !680, size: 128, elements: !885)
!885 = !{!886, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !680, file: !680, baseType: !887, size: 64, align: 64)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !794, file: !794, size: 64, align: 64, elements: !730)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !680, file: !680, baseType: !811, size: 32, align: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !680, file: !680, baseType: !890, size: 128, align: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !680, file: !680, size: 128, elements: !891)
!891 = !{!822}
!892 = !DILocation(line: 175, scope: !831)
!893 = !DILocation(line: 177, scope: !831)
!894 = !DILocation(line: 178, scope: !831)
!895 = !DILocalVariable(name: "result", scope: !831, file: !680, line: 175, type: !783)
!896 = !DILocation(line: 200, scope: !831)
!897 = distinct !DISubprogram(name: "get_basic_type_size", linkageName: "__init_get_basic_type_size", scope: !680, file: !680, line: 203, type: !898, spFlags: DISPFlagDefinition, unit: !679, retainedNodes: !785)
!898 = !DISubroutineType(types: !899)
!899 = !{!783, !844}
!900 = !DILocation(line: 203, scope: !897)
!901 = !DILocalVariable(name: "t", scope: !897, file: !680, line: 203, type: !844)
!902 = !DILocation(line: 204, scope: !897)
!903 = !DILocation(line: 205, scope: !897)
!904 = !DILocation(line: 206, scope: !897)
!905 = distinct !DISubprogram(name: "get_struct_size", linkageName: "__init_get_struct_size", scope: !680, file: !680, line: 209, type: !781, spFlags: DISPFlagDefinition, unit: !679, retainedNodes: !785)
!906 = !DILocation(line: 209, scope: !905)
!907 = !DILocalVariable(name: "st", scope: !905, file: !680, line: 209, type: !784)
!908 = !DILocation(line: 210, scope: !905)
!909 = !DILocalVariable(name: "t", scope: !905, file: !680, line: 210, type: !790)
!910 = !DILocation(line: 211, scope: !905)
!911 = !DILocation(line: 212, scope: !905)
!912 = !DILocation(line: 214, scope: !905)
!913 = !DILocalVariable(name: "result", scope: !905, file: !680, line: 214, type: !783)
!914 = !DILocation(line: 215, scope: !905)
!915 = !DILocalVariable(name: "biggest_member", scope: !905, file: !680, line: 215, type: !783)
!916 = !DILocation(line: 216, scope: !905)
!917 = !DILocalVariable(name: "m", scope: !905, file: !680, line: 216, type: !820)
!918 = !DILocalVariable(name: "i", scope: !905, file: !680, line: 216, type: !783)
!919 = !DILocation(line: 217, scope: !905)
!920 = !DILocalVariable(name: "member_size", scope: !905, file: !680, line: 217, type: !783)
!921 = !DILocation(line: 218, scope: !905)
!922 = !DILocalVariable(name: "alignment", scope: !905, file: !680, line: 218, type: !783)
!923 = !DILocation(line: 219, scope: !905)
!924 = !DILocation(line: 220, scope: !905)
!925 = !DILocation(line: 221, scope: !905)
!926 = !DILocation(line: 222, scope: !905)
!927 = !DILocation(line: 223, scope: !905)
!928 = !DILocation(line: 225, scope: !905)
!929 = !DILocation(line: 226, scope: !905)
!930 = !DILocation(line: 227, scope: !905)
!931 = !DILocalVariable(name: "align", scope: !905, file: !680, line: 227, type: !783)
!932 = !DILocation(line: 228, scope: !905)
!933 = !DILocation(line: 229, scope: !905)
!934 = distinct !DISubprogram(name: "get_type_size", linkageName: "__init_get_type_size", scope: !680, file: !680, line: 232, type: !781, spFlags: DISPFlagDefinition, unit: !679, retainedNodes: !785)
!935 = !DILocation(line: 232, scope: !934)
!936 = !DILocalVariable(name: "t", scope: !934, file: !680, line: 232, type: !784)
!937 = !DILocation(line: 233, scope: !934)
!938 = !DILocalVariable(name: "ti", scope: !934, file: !680, line: 233, type: !836)
!939 = !DILocation(line: 234, scope: !934)
!940 = !DILocalVariable(name: "result", scope: !934, file: !680, line: 234, type: !783)
!941 = !DILocation(line: 257, scope: !934)
!942 = distinct !DISubprogram(name: "get_struct_member_offset", linkageName: "__init_get_struct_member_offset", scope: !680, file: !680, line: 260, type: !943, spFlags: DISPFlagDefinition, unit: !679, retainedNodes: !785)
!943 = !DISubroutineType(types: !944)
!944 = !{!783, !790, !783}
!945 = !DILocation(line: 260, scope: !942)
