; ModuleID = 'init'
source_filename = "init.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.160 = type { i64, ptr }
%__init_TypeInfo.129 = type { i64, %__init_TypeUnion.128 }
%__init_TypeUnion.128 = type { %__init_StructType.120 }
%__init_StructType.120 = type { %slice.157, %string.116, i32 }
%slice.157 = type { i64, ptr }
%string.116 = type { ptr, i64 }
%__init_StructMember.119 = type { %string.116, i64 }
%__init_BasicType.118 = type { i64, i32, i32, %string.116 }
%__init_PointerType.122 = type { i64, i1 }
%__init_EnumType.125 = type { %string.116, %slice.159, i64 }
%slice.159 = type { i64, ptr }
%__init_FunctionType.121 = type { i64, %slice.158 }
%slice.158 = type { i64, ptr }
%__init_ArrayType.123 = type { i64, i32 }

$__init_INVALID_TYPE = comdat nodeduplicate

$__init_type_table = comdat nodeduplicate

$___asan_gen__anon_global = comdat nodeduplicate

$___asan_gen__anon_global.697 = comdat nodeduplicate

$___asan_gen__anon_global.699 = comdat nodeduplicate

$___asan_gen__anon_global.701 = comdat nodeduplicate

$___asan_gen__anon_global.703 = comdat nodeduplicate

$___asan_gen__anon_global.705 = comdat nodeduplicate

$___asan_gen__anon_global.707 = comdat nodeduplicate

$___asan_gen__anon_global.709 = comdat nodeduplicate

$___asan_gen__anon_global.711 = comdat nodeduplicate

$___asan_gen__anon_global.713 = comdat nodeduplicate


!474 = !{!475, !487, !508, !517, !522, !526, !534, !475, !487, !508, !517, !522, !526}
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !473, file: !473, size: 64, align: 64, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!477 = !DIEnumerator(name: "Invalid", value: 0, isUnsigned: true)
!478 = !DIEnumerator(name: "Basic", value: 1, isUnsigned: true)
!479 = !DIEnumerator(name: "Function", value: 2, isUnsigned: true)
!480 = !DIEnumerator(name: "Struct", value: 3, isUnsigned: true)
!481 = !DIEnumerator(name: "Pointer", value: 4, isUnsigned: true)
!482 = !DIEnumerator(name: "Array", value: 5, isUnsigned: true)
!483 = !DIEnumerator(name: "Slice", value: 6, isUnsigned: true)
!484 = !DIEnumerator(name: "Vector", value: 7, isUnsigned: true)
!485 = !DIEnumerator(name: "Enum", value: 8, isUnsigned: true)
!486 = !DIEnumerator(name: "Generic", value: 9, isUnsigned: true)
!487 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !473, file: !473, size: 64, align: 64, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!489 = !DIEnumerator(name: "Bool", value: 0, isUnsigned: true)
!490 = !DIEnumerator(name: "String", value: 1, isUnsigned: true)
!491 = !DIEnumerator(name: "U8", value: 2, isUnsigned: true)
!492 = !DIEnumerator(name: "U16", value: 3, isUnsigned: true)
!493 = !DIEnumerator(name: "U32", value: 4, isUnsigned: true)
!494 = !DIEnumerator(name: "U64", value: 5, isUnsigned: true)
!495 = !DIEnumerator(name: "I8", value: 6, isUnsigned: true)
!496 = !DIEnumerator(name: "I16", value: 7, isUnsigned: true)
!497 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!498 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!499 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!500 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!501 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!502 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!503 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!504 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!505 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!506 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!507 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !473, file: !473, size: 32, align: 32, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516}
!510 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!511 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!512 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!513 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!514 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!515 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!516 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !473, file: !473, size: 32, align: 32, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!520 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!521 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !473, file: !473, size: 64, align: 64, elements: !523)
!523 = !{!524, !525}
!524 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!525 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !473, file: !473, size: 32, align: 32, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533}
!528 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!529 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!530 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!531 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!532 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!533 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!534 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !473, file: !473, size: 32, align: 32, elements: !535)
!535 = !{!536, !537}
!536 = !DIEnumerator(name: "FIRST", value: 0)
!537 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!538 = !{i32 2, !"CodeView", i32 1}
!539 = !{i32 2, !"Debug Info Version", i32 3}
!540 = distinct !DISubprogram(name: "get_struct_alignment", linkageName: "__init_get_struct_alignment", scope: !473, file: !473, line: 155, type: !541, spFlags: DISPFlagDefinition, unit: !472, retainedNodes: !545)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !544}
!543 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!544 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!545 = !{}
!546 = !DILocation(line: 155, scope: !540)
!547 = !DILocalVariable(name: "st", scope: !540, file: !473, line: 155, type: !544)
!548 = !DILocation(line: 156, scope: !540)
!549 = !DILocalVariable(name: "t", scope: !540, file: !473, line: 156, type: !550)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !473, file: !473, size: 320, elements: !551)
!551 = !{!552, !569, !570}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !473, file: !473, baseType: !553, size: 128, align: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !554, size: 128, align: 64, elements: !555)
!554 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !554, file: !554, baseType: !543, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !554, baseType: !558, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !559, size: 64, align: 64, dwarfAddressSpace: 0)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !554, file: !554, size: 192, elements: !560)
!560 = !{!561, !568}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !554, baseType: !562, size: 128, align: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !554, file: !554, size: 128, elements: !563)
!563 = !{!564, !567}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !554, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !566, size: 64, align: 64, dwarfAddressSpace: 0)
!566 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !554, file: !554, baseType: !543, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !554, file: !554, baseType: !544, size: 64, align: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !473, baseType: !562, size: 128, align: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !473, baseType: !571, size: 32, align: 32, offset: 256)
!571 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!572 = !DILocation(line: 157, scope: !540)
!573 = !DILocation(line: 158, scope: !540)
!574 = !DILocation(line: 160, scope: !540)
!575 = !DILocalVariable(name: "biggest", scope: !540, file: !473, line: 160, type: !543)
!576 = !DILocation(line: 161, scope: !540)
!577 = !DILocalVariable(name: "align", scope: !540, file: !473, line: 161, type: !543)
!578 = !DILocation(line: 162, scope: !540)
!579 = !DILocalVariable(name: "m", scope: !540, file: !473, line: 162, type: !580)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !473, file: !473, size: 192, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !473, baseType: !562, size: 128, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !473, file: !473, baseType: !544, size: 64, align: 64, offset: 128)
!584 = !DILocalVariable(name: "i", scope: !540, file: !473, line: 162, type: !543)
!585 = !DILocation(line: 163, scope: !540)
!586 = !DILocalVariable(name: "size", scope: !540, file: !473, line: 163, type: !543)
!587 = !DILocation(line: 164, scope: !540)
!588 = !DILocation(line: 165, scope: !540)
!589 = !DILocation(line: 166, scope: !540)
!590 = !DILocation(line: 170, scope: !540)
!591 = distinct !DISubprogram(name: "get_type_alignment", linkageName: "__init_get_type_alignment", scope: !473, file: !473, line: 173, type: !541, spFlags: DISPFlagDefinition, unit: !472, retainedNodes: !545)
!592 = !DILocation(line: 173, scope: !591)
!593 = !DILocalVariable(name: "t", scope: !591, file: !473, line: 173, type: !544)
!594 = !DILocation(line: 174, scope: !591)
!595 = !DILocalVariable(name: "ti", scope: !591, file: !473, line: 174, type: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !473, file: !473, size: 384, elements: !597)
!597 = !{!598, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !473, file: !473, baseType: !599, size: 64, align: 64)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !554, file: !554, size: 64, align: 64, elements: !476)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !473, file: !473, baseType: !601, size: 320, align: 64, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !473, file: !473, size: 320, elements: !602)
!602 = !{!603, !610, !611, !620, !626, !631, !634, !643, !649}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !473, file: !473, baseType: !604, size: 256, align: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !473, file: !473, size: 256, elements: !605)
!605 = !{!606, !608, !609, !569}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !473, file: !473, baseType: !607, size: 64, align: 64)
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !554, file: !554, size: 64, align: 64, elements: !488)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !473, baseType: !571, size: 32, align: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !473, file: !473, baseType: !571, size: 32, align: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !473, file: !473, baseType: !550, size: 320, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !473, file: !473, baseType: !612, size: 192, align: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !473, file: !473, size: 192, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !473, file: !473, baseType: !544, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !473, file: !473, baseType: !616, size: 128, align: 64, offset: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !554, size: 128, align: 64, elements: !617)
!617 = !{!556, !618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !554, baseType: !619, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !544, size: 64, align: 64, dwarfAddressSpace: 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !473, file: !473, baseType: !621, size: 128, align: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !473, file: !473, size: 128, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !473, file: !473, baseType: !544, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !473, file: !473, baseType: !625, size: 8, align: 8, offset: 64)
!625 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !473, file: !473, baseType: !627, size: 128, align: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !473, file: !473, size: 128, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !473, file: !473, baseType: !544, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !473, file: !473, baseType: !571, size: 32, align: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !473, file: !473, baseType: !632, size: 64, align: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !473, file: !473, size: 64, elements: !633)
!633 = !{!629}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !473, file: !473, baseType: !635, size: 320, align: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !473, file: !473, size: 320, elements: !636)
!636 = !{!582, !637, !642}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !473, file: !473, baseType: !638, size: 128, align: 64, offset: 128)
!638 = !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !554, size: 128, align: 64, elements: !639)
!639 = !{!556, !640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !554, baseType: !641, size: 64, align: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !562, size: 64, align: 64, dwarfAddressSpace: 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !473, file: !473, baseType: !544, size: 64, align: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !473, file: !473, baseType: !644, size: 128, align: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !473, file: !473, size: 128, elements: !645)
!645 = !{!646, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !473, file: !473, baseType: !647, size: 64, align: 64)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !554, file: !554, size: 64, align: 64, elements: !523)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !473, file: !473, baseType: !571, size: 32, align: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !473, file: !473, baseType: !650, size: 128, align: 64)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !473, file: !473, size: 128, elements: !651)
!651 = !{!582}
!652 = !DILocation(line: 175, scope: !591)
!653 = !DILocation(line: 177, scope: !591)
!654 = !DILocation(line: 178, scope: !591)
!655 = !DILocalVariable(name: "result", scope: !591, file: !473, line: 175, type: !543)
!656 = !DILocation(line: 200, scope: !591)
!657 = distinct !DISubprogram(name: "get_basic_type_size", linkageName: "__init_get_basic_type_size", scope: !473, file: !473, line: 203, type: !658, spFlags: DISPFlagDefinition, unit: !472, retainedNodes: !545)
!658 = !DISubroutineType(types: !659)
!659 = !{!543, !604}
!660 = !DILocation(line: 203, scope: !657)
!661 = !DILocalVariable(name: "t", scope: !657, file: !473, line: 203, type: !604)
!662 = !DILocation(line: 204, scope: !657)
!663 = !DILocation(line: 205, scope: !657)
!664 = !DILocation(line: 206, scope: !657)
!665 = distinct !DISubprogram(name: "get_struct_size", linkageName: "__init_get_struct_size", scope: !473, file: !473, line: 209, type: !541, spFlags: DISPFlagDefinition, unit: !472, retainedNodes: !545)
!666 = !DILocation(line: 209, scope: !665)
!667 = !DILocalVariable(name: "st", scope: !665, file: !473, line: 209, type: !544)
!668 = !DILocation(line: 210, scope: !665)
!669 = !DILocalVariable(name: "t", scope: !665, file: !473, line: 210, type: !550)
!670 = !DILocation(line: 211, scope: !665)
!671 = !DILocation(line: 212, scope: !665)
!672 = !DILocation(line: 214, scope: !665)
!673 = !DILocalVariable(name: "result", scope: !665, file: !473, line: 214, type: !543)
!674 = !DILocation(line: 215, scope: !665)
!675 = !DILocalVariable(name: "biggest_member", scope: !665, file: !473, line: 215, type: !543)
!676 = !DILocation(line: 216, scope: !665)
!677 = !DILocalVariable(name: "m", scope: !665, file: !473, line: 216, type: !580)
!678 = !DILocalVariable(name: "i", scope: !665, file: !473, line: 216, type: !543)
!679 = !DILocation(line: 217, scope: !665)
!680 = !DILocalVariable(name: "member_size", scope: !665, file: !473, line: 217, type: !543)
!681 = !DILocation(line: 218, scope: !665)
!682 = !DILocalVariable(name: "alignment", scope: !665, file: !473, line: 218, type: !543)
!683 = !DILocation(line: 219, scope: !665)
!684 = !DILocation(line: 220, scope: !665)
!685 = !DILocation(line: 221, scope: !665)
!686 = !DILocation(line: 222, scope: !665)
!687 = !DILocation(line: 223, scope: !665)
!688 = !DILocation(line: 225, scope: !665)
!689 = !DILocation(line: 226, scope: !665)
!690 = !DILocation(line: 227, scope: !665)
!691 = !DILocalVariable(name: "align", scope: !665, file: !473, line: 227, type: !543)
!692 = !DILocation(line: 228, scope: !665)
!693 = !DILocation(line: 229, scope: !665)
!694 = distinct !DISubprogram(name: "get_type_size", linkageName: "__init_get_type_size", scope: !473, file: !473, line: 232, type: !541, spFlags: DISPFlagDefinition, unit: !472, retainedNodes: !545)
!695 = !DILocation(line: 232, scope: !694)
!696 = !DILocalVariable(name: "t", scope: !694, file: !473, line: 232, type: !544)
!697 = !DILocation(line: 233, scope: !694)
!698 = !DILocalVariable(name: "ti", scope: !694, file: !473, line: 233, type: !596)
!699 = !DILocation(line: 234, scope: !694)
!700 = !DILocalVariable(name: "result", scope: !694, file: !473, line: 234, type: !543)
!701 = !DILocation(line: 257, scope: !694)
!702 = distinct !DISubprogram(name: "get_struct_member_offset", linkageName: "__init_get_struct_member_offset", scope: !473, file: !473, line: 260, type: !703, spFlags: DISPFlagDefinition, unit: !472, retainedNodes: !545)
!703 = !DISubroutineType(types: !704)
!704 = !{!543, !550, !543}
!705 = !DILocation(line: 260, scope: !702)
