; ModuleID = 'init'
source_filename = "init.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.302 = type { i64, ptr }
%__init_TypeInfo.261 = type { i64, %__init_TypeUnion.260 }
%__init_TypeUnion.260 = type { %__init_StructType.252 }
%__init_StructType.252 = type { %slice.297, %string.248, i32 }
%slice.297 = type { i64, ptr }
%string.248 = type { ptr, i64 }
%__init_StructMember.251 = type { %string.248, i64 }
%__init_BasicType.250 = type { i64, i32, i32, %string.248 }
%__init_PointerType.254 = type { i64, i1 }
%__init_EnumType.257 = type { %string.248, %slice.299, i64 }
%slice.299 = type { i64, ptr }
%__init_FunctionType.253 = type { i64, %slice.298 }
%slice.298 = type { i64, ptr }
%__init_ArrayType.255 = type { i64, i32 }

$__init_INVALID_TYPE = comdat nodeduplicate

$__init_type_table = comdat nodeduplicate

$___asan_gen__anon_global = comdat nodeduplicate

$___asan_gen__anon_global.875 = comdat nodeduplicate

$___asan_gen__anon_global.877 = comdat nodeduplicate

$___asan_gen__anon_global.879 = comdat nodeduplicate

$___asan_gen__anon_global.881 = comdat nodeduplicate

$___asan_gen__anon_global.883 = comdat nodeduplicate

$___asan_gen__anon_global.885 = comdat nodeduplicate

$___asan_gen__anon_global.887 = comdat nodeduplicate

$___asan_gen__anon_global.889 = comdat nodeduplicate

$___asan_gen__anon_global.891 = comdat nodeduplicate


!621 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !586, file: !586, size: 32, align: 32, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629}
!623 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!624 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!625 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!626 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!627 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!628 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!629 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !586, file: !586, size: 32, align: 32, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!633 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!634 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !586, file: !586, size: 64, align: 64, elements: !636)
!636 = !{!637, !638}
!637 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!638 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!639 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !586, file: !586, size: 32, align: 32, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646}
!641 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!642 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!643 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!644 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!645 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!646 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !586, file: !586, size: 32, align: 32, elements: !648)
!648 = !{!649, !650}
!649 = !DIEnumerator(name: "FIRST", value: 0)
!650 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_GLattr", scope: !586, file: !586, size: 32, align: 32, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!653 = !DIEnumerator(name: "RED_SIZE", value: 0, isUnsigned: true)
!654 = !DIEnumerator(name: "GREEN_SIZE", value: 1, isUnsigned: true)
!655 = !DIEnumerator(name: "BLUE_SIZE", value: 2, isUnsigned: true)
!656 = !DIEnumerator(name: "ALPHA_SIZE", value: 3, isUnsigned: true)
!657 = !DIEnumerator(name: "BUFFER_SIZE", value: 4, isUnsigned: true)
!658 = !DIEnumerator(name: "DOUBLEBUFFER", value: 5, isUnsigned: true)
!659 = !DIEnumerator(name: "DEPTH_SIZE", value: 6, isUnsigned: true)
!660 = !DIEnumerator(name: "STENCIL_SIZE", value: 7, isUnsigned: true)
!661 = !DIEnumerator(name: "ACCUM_RED_SIZE", value: 8, isUnsigned: true)
!662 = !DIEnumerator(name: "ACCUM_GREEN_SIZE", value: 9, isUnsigned: true)
!663 = !DIEnumerator(name: "ACCUM_BLUE_SIZE", value: 10, isUnsigned: true)
!664 = !DIEnumerator(name: "ACCUM_ALPHA_SIZE", value: 11, isUnsigned: true)
!665 = !DIEnumerator(name: "STEREO", value: 12, isUnsigned: true)
!666 = !DIEnumerator(name: "MULTISAMPLEBUFFERS", value: 13, isUnsigned: true)
!667 = !DIEnumerator(name: "MULTISAMPLESAMPLES", value: 14, isUnsigned: true)
!668 = !DIEnumerator(name: "ACCELERATED_VISUAL", value: 15, isUnsigned: true)
!669 = !DIEnumerator(name: "RETAINED_BACKING", value: 16, isUnsigned: true)
!670 = !DIEnumerator(name: "CONTEXT_MAJOR_VERSION", value: 17, isUnsigned: true)
!671 = !DIEnumerator(name: "CONTEXT_MINOR_VERSION", value: 18, isUnsigned: true)
!672 = !DIEnumerator(name: "CONTEXT_FLAGS", value: 19, isUnsigned: true)
!673 = !DIEnumerator(name: "CONTEXT_PROFILE_MASK", value: 20, isUnsigned: true)
!674 = !DIEnumerator(name: "SHARE_WITH_CURRENT_CONTEXT", value: 21, isUnsigned: true)
!675 = !DIEnumerator(name: "FRAMEBUFFER_SRGB_CAPABLE", value: 22, isUnsigned: true)
!676 = !DIEnumerator(name: "CONTEXT_RELEASE_BEHAVIOR", value: 23, isUnsigned: true)
!677 = !DIEnumerator(name: "CONTEXT_RESET_NOTIFICATION", value: 24, isUnsigned: true)
!678 = !DIEnumerator(name: "CONTEXT_NO_ERROR", value: 25, isUnsigned: true)
!679 = !DIEnumerator(name: "FLOATBUFFERS", value: 26, isUnsigned: true)
!680 = !DIEnumerator(name: "EGL_PLATFORM", value: 27, isUnsigned: true)
!681 = !{i32 2, !"CodeView", i32 1}
!682 = !{i32 2, !"Debug Info Version", i32 3}
!683 = distinct !DISubprogram(name: "get_struct_alignment", linkageName: "__init_get_struct_alignment", scope: !586, file: !586, line: 155, type: !684, spFlags: DISPFlagDefinition, unit: !585, retainedNodes: !688)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !687}
!686 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!687 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!688 = !{}
!689 = !DILocation(line: 155, scope: !683)
!690 = !DILocalVariable(name: "st", scope: !683, file: !586, line: 155, type: !687)
!691 = !DILocation(line: 156, scope: !683)
!692 = !DILocalVariable(name: "t", scope: !683, file: !586, line: 156, type: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !586, file: !586, size: 320, elements: !694)
!694 = !{!695, !712, !713}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !586, file: !586, baseType: !696, size: 128, align: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !697, size: 128, align: 64, elements: !698)
!697 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !697, file: !697, baseType: !686, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !697, baseType: !701, size: 64, align: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !702, size: 64, align: 64, dwarfAddressSpace: 0)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !697, file: !697, size: 192, elements: !703)
!703 = !{!704, !711}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !697, baseType: !705, size: 128, align: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !697, file: !697, size: 128, elements: !706)
!706 = !{!707, !710}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !697, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !709, size: 64, align: 64, dwarfAddressSpace: 0)
!709 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !697, file: !697, baseType: !686, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !697, file: !697, baseType: !687, size: 64, align: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !586, file: !586, baseType: !705, size: 128, align: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !586, baseType: !714, size: 32, align: 32, offset: 256)
!714 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!715 = !DILocation(line: 157, scope: !683)
!716 = !DILocation(line: 158, scope: !683)
!717 = !DILocation(line: 160, scope: !683)
!718 = !DILocalVariable(name: "biggest", scope: !683, file: !586, line: 160, type: !686)
!719 = !DILocation(line: 161, scope: !683)
!720 = !DILocalVariable(name: "align", scope: !683, file: !586, line: 161, type: !686)
!721 = !DILocation(line: 162, scope: !683)
!722 = !DILocalVariable(name: "m", scope: !683, file: !586, line: 162, type: !723)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !586, file: !586, size: 192, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !586, file: !586, baseType: !705, size: 128, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !586, file: !586, baseType: !687, size: 64, align: 64, offset: 128)
!727 = !DILocalVariable(name: "i", scope: !683, file: !586, line: 162, type: !686)
!728 = !DILocation(line: 163, scope: !683)
!729 = !DILocalVariable(name: "size", scope: !683, file: !586, line: 163, type: !686)
!730 = !DILocation(line: 164, scope: !683)
!731 = !DILocation(line: 165, scope: !683)
!732 = !DILocation(line: 166, scope: !683)
!733 = !DILocation(line: 170, scope: !683)
!734 = distinct !DISubprogram(name: "get_type_alignment", linkageName: "__init_get_type_alignment", scope: !586, file: !586, line: 173, type: !684, spFlags: DISPFlagDefinition, unit: !585, retainedNodes: !688)
!735 = !DILocation(line: 173, scope: !734)
!736 = !DILocalVariable(name: "t", scope: !734, file: !586, line: 173, type: !687)
!737 = !DILocation(line: 174, scope: !734)
!738 = !DILocalVariable(name: "ti", scope: !734, file: !586, line: 174, type: !739)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !586, file: !586, size: 384, elements: !740)
!740 = !{!741, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !586, file: !586, baseType: !742, size: 64, align: 64)
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !697, file: !697, size: 64, align: 64, elements: !589)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !586, file: !586, baseType: !744, size: 320, align: 64, offset: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !586, file: !586, size: 320, elements: !745)
!745 = !{!746, !753, !754, !763, !769, !774, !777, !786, !792}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !586, file: !586, baseType: !747, size: 256, align: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !586, file: !586, size: 256, elements: !748)
!748 = !{!749, !751, !752, !712}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !586, file: !586, baseType: !750, size: 64, align: 64)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !697, file: !697, size: 64, align: 64, elements: !601)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !586, baseType: !714, size: 32, align: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !586, baseType: !714, size: 32, align: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !586, file: !586, baseType: !693, size: 320, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !586, file: !586, baseType: !755, size: 192, align: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !586, file: !586, size: 192, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !586, file: !586, baseType: !687, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !586, file: !586, baseType: !759, size: 128, align: 64, offset: 64)
!759 = !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !697, size: 128, align: 64, elements: !760)
!760 = !{!699, !761}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !697, baseType: !762, size: 64, align: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !687, size: 64, align: 64, dwarfAddressSpace: 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !586, file: !586, baseType: !764, size: 128, align: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !586, file: !586, size: 128, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !586, file: !586, baseType: !687, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !586, file: !586, baseType: !768, size: 8, align: 8, offset: 64)
!768 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !586, file: !586, baseType: !770, size: 128, align: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !586, file: !586, size: 128, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !586, file: !586, baseType: !687, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !586, file: !586, baseType: !714, size: 32, align: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !586, file: !586, baseType: !775, size: 64, align: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !586, file: !586, size: 64, elements: !776)
!776 = !{!772}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !586, file: !586, baseType: !778, size: 320, align: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !586, file: !586, size: 320, elements: !779)
!779 = !{!725, !780, !785}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !586, file: !586, baseType: !781, size: 128, align: 64, offset: 128)
!781 = !DICompositeType(tag: DW_TAG_structure_type, scope: !697, file: !697, size: 128, align: 64, elements: !782)
!782 = !{!699, !783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !697, baseType: !784, size: 64, align: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !705, size: 64, align: 64, dwarfAddressSpace: 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !586, file: !586, baseType: !687, size: 64, align: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !586, file: !586, baseType: !787, size: 128, align: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !586, file: !586, size: 128, elements: !788)
!788 = !{!789, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !586, file: !586, baseType: !790, size: 64, align: 64)
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !697, file: !697, size: 64, align: 64, elements: !636)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !586, file: !586, baseType: !714, size: 32, align: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !586, file: !586, baseType: !793, size: 128, align: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !586, file: !586, size: 128, elements: !794)
!794 = !{!725}
!795 = !DILocation(line: 175, scope: !734)
!796 = !DILocation(line: 177, scope: !734)
!797 = !DILocation(line: 178, scope: !734)
!798 = !DILocalVariable(name: "result", scope: !734, file: !586, line: 175, type: !686)
!799 = !DILocation(line: 200, scope: !734)
!800 = distinct !DISubprogram(name: "get_basic_type_size", linkageName: "__init_get_basic_type_size", scope: !586, file: !586, line: 203, type: !801, spFlags: DISPFlagDefinition, unit: !585, retainedNodes: !688)
!801 = !DISubroutineType(types: !802)
!802 = !{!686, !747}
!803 = !DILocation(line: 203, scope: !800)
!804 = !DILocalVariable(name: "t", scope: !800, file: !586, line: 203, type: !747)
!805 = !DILocation(line: 204, scope: !800)
!806 = !DILocation(line: 205, scope: !800)
!807 = !DILocation(line: 206, scope: !800)
!808 = distinct !DISubprogram(name: "get_struct_size", linkageName: "__init_get_struct_size", scope: !586, file: !586, line: 209, type: !684, spFlags: DISPFlagDefinition, unit: !585, retainedNodes: !688)
!809 = !DILocation(line: 209, scope: !808)
!810 = !DILocalVariable(name: "st", scope: !808, file: !586, line: 209, type: !687)
!811 = !DILocation(line: 210, scope: !808)
!812 = !DILocalVariable(name: "t", scope: !808, file: !586, line: 210, type: !693)
!813 = !DILocation(line: 211, scope: !808)
!814 = !DILocation(line: 212, scope: !808)
!815 = !DILocation(line: 214, scope: !808)
!816 = !DILocalVariable(name: "result", scope: !808, file: !586, line: 214, type: !686)
!817 = !DILocation(line: 215, scope: !808)
!818 = !DILocalVariable(name: "biggest_member", scope: !808, file: !586, line: 215, type: !686)
!819 = !DILocation(line: 216, scope: !808)
!820 = !DILocalVariable(name: "m", scope: !808, file: !586, line: 216, type: !723)
!821 = !DILocalVariable(name: "i", scope: !808, file: !586, line: 216, type: !686)
!822 = !DILocation(line: 217, scope: !808)
!823 = !DILocalVariable(name: "member_size", scope: !808, file: !586, line: 217, type: !686)
!824 = !DILocation(line: 218, scope: !808)
!825 = !DILocalVariable(name: "alignment", scope: !808, file: !586, line: 218, type: !686)
!826 = !DILocation(line: 219, scope: !808)
!827 = !DILocation(line: 220, scope: !808)
!828 = !DILocation(line: 221, scope: !808)
!829 = !DILocation(line: 222, scope: !808)
!830 = !DILocation(line: 223, scope: !808)
!831 = !DILocation(line: 225, scope: !808)
!832 = !DILocation(line: 226, scope: !808)
!833 = !DILocation(line: 227, scope: !808)
!834 = !DILocalVariable(name: "align", scope: !808, file: !586, line: 227, type: !686)
!835 = !DILocation(line: 228, scope: !808)
!836 = !DILocation(line: 229, scope: !808)
!837 = distinct !DISubprogram(name: "get_type_size", linkageName: "__init_get_type_size", scope: !586, file: !586, line: 232, type: !684, spFlags: DISPFlagDefinition, unit: !585, retainedNodes: !688)
!838 = !DILocation(line: 232, scope: !837)
!839 = !DILocalVariable(name: "t", scope: !837, file: !586, line: 232, type: !687)
!840 = !DILocation(line: 233, scope: !837)
!841 = !DILocalVariable(name: "ti", scope: !837, file: !586, line: 233, type: !739)
!842 = !DILocation(line: 234, scope: !837)
!843 = !DILocalVariable(name: "result", scope: !837, file: !586, line: 234, type: !686)
!844 = !DILocation(line: 257, scope: !837)
!845 = distinct !DISubprogram(name: "get_struct_member_offset", linkageName: "__init_get_struct_member_offset", scope: !586, file: !586, line: 260, type: !846, spFlags: DISPFlagDefinition, unit: !585, retainedNodes: !688)
!846 = !DISubroutineType(types: !847)
!847 = !{!686, !693, !686}
!848 = !DILocation(line: 260, scope: !845)
