; ModuleID = 'io'
source_filename = "io.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.259 = type { i64, ptr }
%string.213 = type { ptr, i64 }
%__init_TypeInfo.226 = type { i64, %__init_TypeUnion.225 }
%__init_TypeUnion.225 = type { %__init_StructType.217 }
%__init_StructType.217 = type { %slice.256, %string.213, i32 }
%slice.256 = type { i64, ptr }
%slice.257 = type { i64, ptr }
%__init_BasicType.215 = type { i64, i32, i32, %string.213 }
%__init_FunctionType.218 = type { i64, %slice.257 }
%__init_PointerType.219 = type { i64, i1 }
%__init_ArrayType.220 = type { i64, i32 }
%__init_SliceType.221 = type { i64 }
%__init_EnumType.222 = type { %string.213, %slice.258, i64 }
%slice.258 = type { i64, ptr }
%__init_GenericType.224 = type { %string.213 }
%__init_Arg.214 = type { i64, ptr }
%__init_StructMember.216 = type { %string.213, i64 }
%slice.262 = type { i64, ptr }
%__mem_Allocator.227 = type { ptr, ptr, ptr }
%slice.261 = type { i64, ptr }
%slice.260 = type { i64, ptr }

$___asan_gen__anon_global = comdat nodeduplicate

$___asan_gen__anon_global.19 = comdat nodeduplicate

$___asan_gen__anon_global.21 = comdat nodeduplicate

$___asan_gen__anon_global.23 = comdat nodeduplicate

$___asan_gen__anon_global.25 = comdat nodeduplicate

$___asan_gen__anon_global.27 = comdat nodeduplicate

$___asan_gen__anon_global.29 = comdat nodeduplicate


!4 = !{ptr @___asan_gen__anon_global.25}
!5 = !{ptr @___asan_gen__anon_global.27}
!6 = !{ptr @___asan_gen__anon_global.29}
!7 = !{ptr @___asan_gen__anon_global.31}
!8 = !{ptr @___asan_gen__anon_global.33}
!9 = !{ptr @___asan_gen__anon_global.35}
!10 = !{ptr @___asan_gen__anon_global.37}
!11 = !{ptr @___asan_gen__anon_global.39}
!12 = !{ptr @___asan_gen__anon_global.41}
!13 = !{ptr @___asan_gen__anon_global.43}
!14 = !{ptr @___asan_gen__anon_global.45}
!15 = !{ptr @___asan_gen__anon_global.47}
!16 = distinct !DICompileUnit(language: DW_LANG_C99, file: !17, producer: "RCP Compiler", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, splitDebugInlining: false)
!17 = !DIFile(filename: "io.rcp", directory: "E:\\C_Projects\\ReComp\\std")
!18 = !{!19, !31, !52, !61, !66, !70, !78, !19, !31, !52, !61, !66, !70}
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !17, file: !17, size: 64, align: 64, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!21 = !DIEnumerator(name: "Invalid", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "Basic", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "Function", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "Struct", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "Pointer", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "Array", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "Slice", value: 6, isUnsigned: true)
!28 = !DIEnumerator(name: "Vector", value: 7, isUnsigned: true)
!29 = !DIEnumerator(name: "Enum", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "Generic", value: 9, isUnsigned: true)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !17, file: !17, size: 64, align: 64, elements: !32)
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!33 = !DIEnumerator(name: "Bool", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "String", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "U8", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "U16", value: 3, isUnsigned: true)
!37 = !DIEnumerator(name: "U32", value: 4, isUnsigned: true)
!38 = !DIEnumerator(name: "U64", value: 5, isUnsigned: true)
!39 = !DIEnumerator(name: "I8", value: 6, isUnsigned: true)
!40 = !DIEnumerator(name: "I16", value: 7, isUnsigned: true)
!41 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!43 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!44 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!45 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!46 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!47 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!48 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!49 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!50 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!51 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !17, file: !17, size: 32, align: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60}
!54 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!58 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!59 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!60 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !17, file: !17, size: 32, align: 32, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !17, file: !17, size: 64, align: 64, elements: !67)
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !17, file: !17, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!76 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!77 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !17, file: !17, size: 32, align: 32, elements: !79)
!79 = !{!80, !81}
!80 = !DIEnumerator(name: "FIRST", value: 0)
!81 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!82 = !{i32 2, !"CodeView", i32 1}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = distinct !DISubprogram(name: "push_string", linkageName: "__io_push_string", scope: !17, file: !17, line: 9, type: !85, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !87, !95}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[]u32", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !17, size: 128, align: 64, elements: !89)
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !17, file: !17, baseType: !91, size: 64, align: 64)
!91 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u32", baseType: !94, size: 64, align: 64, dwarfAddressSpace: 0)
!94 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !96, file: !96, size: 128, elements: !97)
!96 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!97 = !{!98, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !96, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !96, file: !96, baseType: !91, size: 64, align: 64, offset: 64)
!102 = !{}
!103 = !DILocation(line: 9, scope: !84)
!104 = !DILocalVariable(name: "b", scope: !84, file: !17, line: 9, type: !87)
!105 = !DILocalVariable(name: "to_push", arg: 1, scope: !84, file: !17, line: 9, type: !95)
!106 = !DILocation(line: 10, scope: !84)
!107 = !DILocalVariable(name: "c", scope: !84, file: !17, line: 10, type: !94)
!108 = !DILocalVariable(name: "i", scope: !84, file: !17, line: 10, type: !91)
!109 = !DILocation(line: 11, scope: !84)
!110 = !DILocation(line: 13, scope: !84)
!111 = distinct !DISubprogram(name: "format_uint", linkageName: "__io_format_uint", scope: !17, file: !17, line: 15, type: !112, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !87, !114}
!114 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!115 = !DILocation(line: 15, scope: !111)
!116 = !DILocalVariable(name: "b", scope: !111, file: !17, line: 15, type: !87)
!117 = !DILocalVariable(name: "num_in", arg: 1, scope: !111, file: !17, line: 15, type: !114)
!118 = !DILocation(line: 16, scope: !111)
!119 = !DILocalVariable(name: "temp", scope: !111, file: !17, line: 16, type: !120)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8192, align: 32, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 256, lowerBound: 0)
!123 = !DILocation(line: 17, scope: !111)
!124 = !DILocalVariable(name: "num", scope: !111, file: !17, line: 17, type: !114)
!125 = !DILocation(line: 18, scope: !111)
!126 = !DILocation(line: 19, scope: !111)
!127 = !DILocation(line: 20, scope: !111)
!128 = !DILocation(line: 23, scope: !111)
!129 = !DILocalVariable(name: "count", scope: !111, file: !17, line: 23, type: !91)
!130 = !DILocation(line: 24, scope: !111)
!131 = !DILocation(line: 25, scope: !111)
!132 = !DILocalVariable(name: "digit", scope: !111, file: !17, line: 25, type: !114)
!133 = !DILocation(line: 26, scope: !111)
!134 = !DILocation(line: 27, scope: !111)
!135 = !DILocalVariable(name: "c", scope: !111, file: !17, line: 27, type: !114)
!136 = !DILocation(line: 28, scope: !111)
!137 = !DILocation(line: 29, scope: !111)
!138 = !DILocation(line: 32, scope: !111)
!139 = !DILocalVariable(name: "i", scope: !111, file: !17, line: 32, type: !91)
!140 = !DILocation(line: 33, scope: !111)
!141 = !DILocation(line: 35, scope: !111)
!142 = distinct !DISubprogram(name: "format_int", linkageName: "__io_format_int", scope: !17, file: !17, line: 37, type: !143, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !87, !91}
!145 = !DILocation(line: 37, scope: !142)
!146 = !DILocalVariable(name: "b", scope: !142, file: !17, line: 37, type: !87)
!147 = !DILocalVariable(name: "num_in", arg: 1, scope: !142, file: !17, line: 37, type: !91)
!148 = !DILocation(line: 38, scope: !142)
!149 = !DILocalVariable(name: "temp", scope: !142, file: !17, line: 38, type: !120)
!150 = !DILocation(line: 39, scope: !142)
!151 = !DILocalVariable(name: "num", scope: !142, file: !17, line: 39, type: !91)
!152 = !DILocation(line: 40, scope: !142)
!153 = !DILocation(line: 41, scope: !142)
!154 = !DILocation(line: 42, scope: !142)
!155 = !DILocation(line: 45, scope: !142)
!156 = !DILocalVariable(name: "is_neg", scope: !142, file: !17, line: 45, type: !157)
!157 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DILocation(line: 46, scope: !142)
!159 = !DILocation(line: 47, scope: !142)
!160 = !DILocation(line: 48, scope: !142)
!161 = !DILocation(line: 51, scope: !142)
!162 = !DILocalVariable(name: "count", scope: !142, file: !17, line: 51, type: !91)
!163 = !DILocation(line: 52, scope: !142)
!164 = !DILocation(line: 53, scope: !142)
!165 = !DILocalVariable(name: "digit", scope: !142, file: !17, line: 53, type: !91)
!166 = !DILocation(line: 54, scope: !142)
!167 = !DILocation(line: 55, scope: !142)
!168 = !DILocalVariable(name: "c", scope: !142, file: !17, line: 55, type: !94)
!169 = !DILocation(line: 56, scope: !142)
!170 = !DILocation(line: 57, scope: !142)
!171 = !DILocation(line: 60, scope: !142)
!172 = !DILocation(line: 62, scope: !142)
!173 = !DILocalVariable(name: "i", scope: !142, file: !17, line: 62, type: !91)
!174 = !DILocation(line: 63, scope: !142)
!175 = !DILocation(line: 65, scope: !142)
!176 = distinct !DISubprogram(name: "print_typetype", linkageName: "__io_print_typetype", scope: !17, file: !17, line: 127, type: !177, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !87, !179}
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !17, file: !17, size: 384, elements: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, baseType: !182, size: 64, align: 64)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !96, file: !96, size: 64, align: 64, elements: !20)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !184, size: 320, align: 64, offset: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !17, file: !17, size: 320, elements: !185)
!185 = !{!186, !194, !209, !218, !223, !228, !231, !241, !247}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !17, file: !17, baseType: !187, size: 256, align: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !17, file: !17, size: 256, elements: !188)
!188 = !{!189, !191, !192, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, baseType: !190, size: 64, align: 64)
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !96, file: !96, size: 64, align: 64, elements: !32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !17, baseType: !94, size: 32, align: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !17, baseType: !94, size: 32, align: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !17, baseType: !95, size: 128, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !17, file: !17, baseType: !195, size: 320, align: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !17, file: !17, size: 320, elements: !196)
!196 = !{!197, !193, !208}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !17, file: !17, baseType: !198, size: 128, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !96, size: 128, align: 64, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !96, file: !96, baseType: !91, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !96, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !203, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !96, file: !96, size: 192, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !96, baseType: !95, size: 128, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !96, file: !96, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !17, baseType: !94, size: 32, align: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !17, file: !17, baseType: !210, size: 192, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !17, file: !17, size: 192, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !17, file: !17, baseType: !207, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !17, file: !17, baseType: !214, size: 128, align: 64, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !96, size: 128, align: 64, elements: !215)
!215 = !{!200, !216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !96, baseType: !217, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !207, size: 64, align: 64, dwarfAddressSpace: 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !17, file: !17, baseType: !219, size: 128, align: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !17, file: !17, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !17, file: !17, baseType: !207, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !17, file: !17, baseType: !157, size: 8, align: 8, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !17, file: !17, baseType: !224, size: 128, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !17, file: !17, size: 128, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !207, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !17, file: !17, baseType: !94, size: 32, align: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !17, file: !17, baseType: !229, size: 64, align: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !17, file: !17, size: 64, elements: !230)
!230 = !{!226}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !17, file: !17, baseType: !232, size: 320, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !17, file: !17, size: 320, elements: !233)
!233 = !{!234, !235, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !17, baseType: !95, size: 128, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !17, file: !17, baseType: !236, size: 128, align: 64, offset: 128)
!236 = !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !96, size: 128, align: 64, elements: !237)
!237 = !{!200, !238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !96, baseType: !239, size: 64, align: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !95, size: 64, align: 64, dwarfAddressSpace: 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !207, size: 64, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !17, file: !17, baseType: !242, size: 128, align: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !17, file: !17, size: 128, elements: !243)
!243 = !{!244, !246}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, baseType: !245, size: 64, align: 64)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !96, file: !96, size: 64, align: 64, elements: !67)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !17, file: !17, baseType: !94, size: 32, align: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !17, file: !17, baseType: !248, size: 128, align: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !17, file: !17, size: 128, elements: !249)
!249 = !{!234}
!250 = !DILocation(line: 127, scope: !176)
!251 = !DILocalVariable(name: "b", scope: !176, file: !17, line: 127, type: !87)
!252 = !DILocalVariable(name: "info", arg: 1, scope: !176, file: !17, line: 127, type: !179)
!253 = !DILocation(line: 128, scope: !176)
!254 = !DILocation(line: 130, scope: !176)
!255 = !DILocation(line: 133, scope: !176)
!256 = !DILocation(line: 136, scope: !176)
!257 = !DILocation(line: 137, scope: !176)
!258 = !DILocalVariable(name: "args", scope: !176, file: !17, line: 137, type: !214)
!259 = !DILocation(line: 138, scope: !176)
!260 = !DILocalVariable(name: "arg", scope: !176, file: !17, line: 138, type: !207)
!261 = !DILocalVariable(name: "i", scope: !176, file: !17, line: 138, type: !91)
!262 = !DILocation(line: 139, scope: !176)
!263 = !DILocation(line: 140, scope: !176)
!264 = !DILocation(line: 141, scope: !176)
!265 = !DILocation(line: 144, scope: !176)
!266 = !DILocation(line: 145, scope: !176)
!267 = !DILocation(line: 146, scope: !176)
!268 = !DILocation(line: 147, scope: !176)
!269 = !DILocation(line: 151, scope: !176)
!270 = !DILocation(line: 154, scope: !176)
!271 = !DILocation(line: 155, scope: !176)
!272 = !DILocation(line: 158, scope: !176)
!273 = !DILocation(line: 159, scope: !176)
!274 = !DILocation(line: 162, scope: !176)
!275 = !DILocation(line: 163, scope: !176)
!276 = !DILocation(line: 166, scope: !176)
!277 = !DILocation(line: 169, scope: !176)
!278 = !DILocation(line: 172, scope: !176)
!279 = !DILocation(line: 176, scope: !176)
!280 = distinct !DISubprogram(name: "print_type", linkageName: "__io_print_type", scope: !17, file: !17, line: 178, type: !281, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !87, !283}
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_Arg", scope: !17, file: !17, size: 128, elements: !284)
!284 = !{!226, !285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !17, file: !17, baseType: !286, size: 64, align: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*void", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!287 = !DILocation(line: 178, scope: !280)
!288 = !DILocalVariable(name: "b", scope: !280, file: !17, line: 178, type: !87)
!289 = !DILocalVariable(name: "arg", arg: 1, scope: !280, file: !17, line: 178, type: !283)
!290 = !DILocation(line: 179, scope: !280)
!291 = !DILocalVariable(name: "t", scope: !280, file: !17, line: 179, type: !179)
!292 = !DILocation(line: 180, scope: !280)
!293 = !DILocation(line: 184, scope: !280)
!294 = !DILocalVariable(name: "basic", scope: !280, file: !17, line: 184, type: !187)
!295 = !DILocation(line: 185, scope: !280)
!296 = !DILocation(line: 186, scope: !280)
!297 = !DILocation(line: 187, scope: !280)
!298 = !DILocation(line: 189, scope: !280)
!299 = !DILocation(line: 192, scope: !280)
!300 = !DILocation(line: 193, scope: !280)
!301 = !DILocalVariable(name: "str", scope: !280, file: !17, line: 193, type: !95)
!302 = !DILocation(line: 194, scope: !280)
!303 = !DILocation(line: 203, scope: !280)
!304 = !DILocation(line: 204, scope: !280)
!305 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 204, type: !114)
!306 = !DILocation(line: 205, scope: !280)
!307 = !DILocation(line: 207, scope: !280)
!308 = !DILocation(line: 208, scope: !280)
!309 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 208, type: !114)
!310 = !DILocation(line: 209, scope: !280)
!311 = !DILocation(line: 211, scope: !280)
!312 = !DILocation(line: 212, scope: !280)
!313 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 212, type: !114)
!314 = !DILocation(line: 213, scope: !280)
!315 = !DILocation(line: 215, scope: !280)
!316 = !DILocation(line: 216, scope: !280)
!317 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 216, type: !114)
!318 = !DILocation(line: 217, scope: !280)
!319 = !DILocation(line: 219, scope: !280)
!320 = !DILocation(line: 220, scope: !280)
!321 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 220, type: !91)
!322 = !DILocation(line: 221, scope: !280)
!323 = !DILocation(line: 223, scope: !280)
!324 = !DILocation(line: 224, scope: !280)
!325 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 224, type: !91)
!326 = !DILocation(line: 225, scope: !280)
!327 = !DILocation(line: 227, scope: !280)
!328 = !DILocation(line: 228, scope: !280)
!329 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 228, type: !91)
!330 = !DILocation(line: 229, scope: !280)
!331 = !DILocation(line: 231, scope: !280)
!332 = !DILocation(line: 232, scope: !280)
!333 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 232, type: !91)
!334 = !DILocation(line: 233, scope: !280)
!335 = !DILocation(line: 235, scope: !280)
!336 = !DILocation(line: 236, scope: !280)
!337 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 236, type: !91)
!338 = !DILocation(line: 237, scope: !280)
!339 = !DILocation(line: 239, scope: !280)
!340 = !DILocation(line: 240, scope: !280)
!341 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 240, type: !114)
!342 = !DILocation(line: 241, scope: !280)
!343 = !DILocation(line: 243, scope: !280)
!344 = !DILocation(line: 244, scope: !280)
!345 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 244, type: !346)
!346 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!347 = !DILocation(line: 245, scope: !280)
!348 = !DILocation(line: 247, scope: !280)
!349 = !DILocation(line: 248, scope: !280)
!350 = !DILocalVariable(name: "num", scope: !280, file: !17, line: 248, type: !351)
!351 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!352 = !DILocation(line: 249, scope: !280)
!353 = !DILocation(line: 251, scope: !280)
!354 = !DILocation(line: 252, scope: !280)
!355 = !DILocalVariable(name: "pt", scope: !280, file: !17, line: 252, type: !207)
!356 = !DILocation(line: 253, scope: !280)
!357 = !DILocalVariable(name: "info", scope: !280, file: !17, line: 253, type: !179)
!358 = !DILocation(line: 254, scope: !280)
!359 = !DILocation(line: 257, scope: !280)
!360 = !DILocation(line: 263, scope: !280)
!361 = !DILocalVariable(name: "st", scope: !280, file: !17, line: 263, type: !195)
!362 = !DILocation(line: 264, scope: !280)
!363 = !DILocation(line: 265, scope: !280)
!364 = !DILocation(line: 266, scope: !280)
!365 = !DILocalVariable(name: "n", scope: !280, file: !17, line: 266, type: !91)
!366 = !DILocation(line: 267, scope: !280)
!367 = !DILocalVariable(name: "m", scope: !280, file: !17, line: 267, type: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !17, file: !17, size: 192, elements: !369)
!369 = !{!234, !370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !207, size: 64, align: 64, offset: 128)
!371 = !DILocation(line: 268, scope: !280)
!372 = !DILocation(line: 269, scope: !280)
!373 = !DILocation(line: 270, scope: !280)
!374 = !DILocation(line: 271, scope: !280)
!375 = !DILocalVariable(name: "ptr", scope: !280, file: !17, line: 271, type: !99)
!376 = !DILocation(line: 272, scope: !280)
!377 = !DILocalVariable(name: "offset", scope: !280, file: !17, line: 272, type: !91)
!378 = !DILocation(line: 273, scope: !280)
!379 = !DILocalVariable(name: "mem_arg", scope: !280, file: !17, line: 273, type: !283)
!380 = !DILocation(line: 277, scope: !280)
!381 = !DILocation(line: 279, scope: !280)
!382 = !DILocation(line: 280, scope: !280)
!383 = !DILocation(line: 281, scope: !280)
!384 = !DILocation(line: 284, scope: !280)
!385 = !DILocation(line: 299, scope: !280)
!386 = distinct !DISubprogram(name: "builder_to_string", linkageName: "__io_builder_to_string", scope: !17, file: !17, line: 301, type: !387, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!387 = !DISubroutineType(types: !388)
!388 = !{!389, !87}
!389 = !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !17, size: 128, align: 64, elements: !390)
!390 = !{!90, !391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !99, size: 64, align: 64, offset: 64)
!392 = !DILocation(line: 301, scope: !386)
!393 = !DILocalVariable(name: "b_in", scope: !386, file: !17, line: 301, type: !87)
!394 = !DILocation(line: 302, scope: !386)
!395 = !DILocalVariable(name: "b", scope: !386, file: !17, line: 302, type: !87)
!396 = !DILocation(line: 303, scope: !386)
!397 = !DILocalVariable(name: "alloc", scope: !386, file: !17, line: 303, type: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !17, file: !17, size: 192, elements: !399)
!399 = !{!400, !406, !410}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !17, file: !17, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(int, *__mem_Allocator) -> ?*", baseType: !402, size: 64, align: 64, dwarfAddressSpace: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!286, !91, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__mem_Allocator", baseType: !405, size: 64, align: 64, dwarfAddressSpace: 0)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !96, file: !96, size: 192, align: 64, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !17, file: !17, baseType: !407, size: 64, align: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(*, *__mem_Allocator)", baseType: !408, size: 64, align: 64, dwarfAddressSpace: 0)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !286, !404}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !286, size: 64, align: 64, offset: 128)
!411 = !DILocation(line: 304, scope: !386)
!412 = !DILocalVariable(name: "res", scope: !386, file: !17, line: 304, type: !389)
!413 = !DILocation(line: 306, scope: !386)
!414 = !DILocalVariable(name: "i", scope: !386, file: !17, line: 306, type: !91)
!415 = !DILocation(line: 307, scope: !386)
!416 = !DILocalVariable(name: "ptr", scope: !386, file: !17, line: 307, type: !99)
!417 = !DILocation(line: 308, scope: !386)
!418 = !DILocation(line: 309, scope: !386)
!419 = !DILocation(line: 310, scope: !386)
!420 = !DILocation(line: 313, scope: !386)
!421 = !DILocalVariable(name: "size", scope: !386, file: !17, line: 313, type: !91)
!422 = !DILocation(line: 314, scope: !386)
!423 = !DILocalVariable(name: "j", scope: !386, file: !17, line: 314, type: !91)
!424 = !DILocation(line: 315, scope: !386)
!425 = !DILocation(line: 319, scope: !386)
!426 = distinct !DISubprogram(name: "__internal_print", linkageName: "__io___internal_print", scope: !17, file: !17, line: 322, type: !427, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!427 = !DISubroutineType(types: !428)
!428 = !{!88, !95, !429}
!429 = !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !17, size: 128, align: 64, elements: !430)
!430 = !{!90, !431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !432, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_Arg", baseType: !283, size: 64, align: 64, dwarfAddressSpace: 0)
!433 = !DILocation(line: 322, scope: !426)
!434 = !DILocalVariable(name: "fmt", scope: !426, file: !17, line: 322, type: !95)
!435 = !DILocalVariable(name: "args", arg: 1, scope: !426, file: !17, line: 322, type: !429)
!436 = !DILocation(line: 323, scope: !426)
!437 = !DILocalVariable(name: "alloc", scope: !426, file: !17, line: 323, type: !398)
!438 = !DILocation(line: 324, scope: !426)
!439 = !DILocalVariable(name: "builder", scope: !426, file: !17, line: 324, type: !88)
!440 = !DILocation(line: 325, scope: !426)
!441 = !DILocalVariable(name: "arg_count", scope: !426, file: !17, line: 325, type: !91)
!442 = !DILocation(line: 326, scope: !426)
!443 = !DILocalVariable(name: "need_to_print_arg", scope: !426, file: !17, line: 326, type: !157)
!444 = !DILocation(line: 327, scope: !426)
!445 = !DILocalVariable(name: "c", scope: !426, file: !17, line: 327, type: !94)
!446 = !DILocalVariable(name: "i", scope: !426, file: !17, line: 327, type: !91)
!447 = !DILocation(line: 328, scope: !426)
!448 = !DILocation(line: 329, scope: !426)
!449 = !DILocation(line: 331, scope: !426)
!450 = !DILocation(line: 332, scope: !426)
!451 = !DILocalVariable(name: "arg", scope: !426, file: !17, line: 332, type: !283)
!452 = !DILocation(line: 333, scope: !426)
!453 = !DILocation(line: 334, scope: !426)
!454 = !DILocalVariable(name: "t", scope: !426, file: !17, line: 334, type: !179)
!455 = !DILocation(line: 335, scope: !426)
!456 = !DILocation(line: 336, scope: !426)
!457 = !DILocalVariable(name: "str", scope: !426, file: !17, line: 336, type: !99)
!458 = !DILocation(line: 337, scope: !426)
!459 = !DILocalVariable(name: "i", scope: !426, file: !17, line: 337, type: !91)
!460 = !DILocation(line: 338, scope: !426)
!461 = !DILocation(line: 341, scope: !426)
!462 = !DILocation(line: 342, scope: !426)
!463 = !DILocation(line: 346, scope: !426)
!464 = !DILocation(line: 350, scope: !426)
!465 = distinct !DISubprogram(name: "print", linkageName: "__io_print", scope: !17, file: !17, line: 353, type: !466, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !95}
!468 = !DILocation(line: 353, scope: !465)
!469 = !DILocalVariable(name: "str", scope: !465, file: !17, line: 353, type: !95)
!470 = !DILocalVariable(name: "args", arg: 1, scope: !465, file: !17, line: 353, type: !429)
!471 = !DILocation(line: 354, scope: !465)
!472 = !DILocalVariable(name: "builder", scope: !465, file: !17, line: 354, type: !88)
!473 = !DILocation(line: 355, scope: !465)
!474 = !DILocalVariable(name: "res", scope: !465, file: !17, line: 355, type: !389)
!475 = !DILocation(line: 356, scope: !465)
!476 = !DILocation(line: 357, scope: !465)
!477 = !DILocation(line: 358, scope: !465)
!478 = !DILocation(line: 359, scope: !465)
!479 = distinct !DISubprogram(name: "println", linkageName: "__io_println", scope: !17, file: !17, line: 361, type: !466, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !102)
!480 = !DILocation(line: 361, scope: !479)
!481 = !DILocalVariable(name: "str", scope: !479, file: !17, line: 361, type: !95)
!482 = !DILocalVariable(name: "args", arg: 1, scope: !479, file: !17, line: 361, type: !429)
!483 = !DILocation(line: 362, scope: !479)
!484 = !DILocalVariable(name: "builder", scope: !479, file: !17, line: 362, type: !88)
!485 = !DILocation(line: 363, scope: !479)
!486 = !DILocation(line: 364, scope: !479)
!487 = !DILocalVariable(name: "res", scope: !479, file: !17, line: 364, type: !389)
!488 = !DILocation(line: 365, scope: !479)
!489 = !DILocation(line: 366, scope: !479)
!490 = !DILocation(line: 367, scope: !479)
!491 = !DILocation(line: 369, scope: !479)
