; ModuleID = 'io'
source_filename = "io.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.421 = type { i64, ptr }
%string.365 = type { ptr, i64 }
%__init_TypeInfo.378 = type { i64, %__init_TypeUnion.377 }
%__init_TypeUnion.377 = type { %__init_StructType.369 }
%__init_StructType.369 = type { %slice.416, %string.365, i32 }
%slice.416 = type { i64, ptr }
%slice.417 = type { i64, ptr }
%__init_BasicType.367 = type { i64, i32, i32, %string.365 }
%__init_FunctionType.370 = type { i64, %slice.417 }
%__init_PointerType.371 = type { i64, i1 }
%__init_ArrayType.372 = type { i64, i32 }
%__init_SliceType.373 = type { i64 }
%__init_EnumType.374 = type { %string.365, %slice.418, i64 }
%slice.418 = type { i64, ptr }
%__init_GenericType.376 = type { %string.365 }
%__init_Arg.366 = type { i64, ptr }
%__init_StructMember.368 = type { %string.365, i64 }
%slice.424 = type { i64, ptr }
%__mem_Allocator.379 = type { ptr, ptr, ptr }
%slice.423 = type { i64, ptr }
%slice.422 = type { i64, ptr }

$___asan_gen__anon_global = comdat nodeduplicate

$___asan_gen__anon_global.19 = comdat nodeduplicate

$___asan_gen__anon_global.21 = comdat nodeduplicate

$___asan_gen__anon_global.23 = comdat nodeduplicate

$___asan_gen__anon_global.25 = comdat nodeduplicate

$___asan_gen__anon_global.27 = comdat nodeduplicate

$___asan_gen__anon_global.29 = comdat nodeduplicate


!41 = !DIEnumerator(name: "I32", value: 8, isUnsigned: true)
!42 = !DIEnumerator(name: "I64", value: 9, isUnsigned: true)
!43 = !DIEnumerator(name: "F32", value: 10, isUnsigned: true)
!44 = !DIEnumerator(name: "F64", value: 11, isUnsigned: true)
!45 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!46 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!47 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!48 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!49 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!50 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!51 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !17, file: !17, size: 32, align: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60}
!54 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!57 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!58 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!59 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!60 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !17, file: !17, size: 32, align: 32, elements: !62)
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !17, file: !17, size: 64, align: 64, elements: !67)
!67 = !{!68, !69}
!68 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !17, file: !17, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!76 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!77 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !17, file: !17, size: 32, align: 32, elements: !79)
!79 = !{!80, !81}
!80 = !DIEnumerator(name: "FIRST", value: 0)
!81 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_GLattr", scope: !17, file: !17, size: 32, align: 32, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!84 = !DIEnumerator(name: "RED_SIZE", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "GREEN_SIZE", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "BLUE_SIZE", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "ALPHA_SIZE", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "BUFFER_SIZE", value: 4, isUnsigned: true)
!89 = !DIEnumerator(name: "DOUBLEBUFFER", value: 5, isUnsigned: true)
!90 = !DIEnumerator(name: "DEPTH_SIZE", value: 6, isUnsigned: true)
!91 = !DIEnumerator(name: "STENCIL_SIZE", value: 7, isUnsigned: true)
!92 = !DIEnumerator(name: "ACCUM_RED_SIZE", value: 8, isUnsigned: true)
!93 = !DIEnumerator(name: "ACCUM_GREEN_SIZE", value: 9, isUnsigned: true)
!94 = !DIEnumerator(name: "ACCUM_BLUE_SIZE", value: 10, isUnsigned: true)
!95 = !DIEnumerator(name: "ACCUM_ALPHA_SIZE", value: 11, isUnsigned: true)
!96 = !DIEnumerator(name: "STEREO", value: 12, isUnsigned: true)
!97 = !DIEnumerator(name: "MULTISAMPLEBUFFERS", value: 13, isUnsigned: true)
!98 = !DIEnumerator(name: "MULTISAMPLESAMPLES", value: 14, isUnsigned: true)
!99 = !DIEnumerator(name: "ACCELERATED_VISUAL", value: 15, isUnsigned: true)
!100 = !DIEnumerator(name: "RETAINED_BACKING", value: 16, isUnsigned: true)
!101 = !DIEnumerator(name: "CONTEXT_MAJOR_VERSION", value: 17, isUnsigned: true)
!102 = !DIEnumerator(name: "CONTEXT_MINOR_VERSION", value: 18, isUnsigned: true)
!103 = !DIEnumerator(name: "CONTEXT_FLAGS", value: 19, isUnsigned: true)
!104 = !DIEnumerator(name: "CONTEXT_PROFILE_MASK", value: 20, isUnsigned: true)
!105 = !DIEnumerator(name: "SHARE_WITH_CURRENT_CONTEXT", value: 21, isUnsigned: true)
!106 = !DIEnumerator(name: "FRAMEBUFFER_SRGB_CAPABLE", value: 22, isUnsigned: true)
!107 = !DIEnumerator(name: "CONTEXT_RELEASE_BEHAVIOR", value: 23, isUnsigned: true)
!108 = !DIEnumerator(name: "CONTEXT_RESET_NOTIFICATION", value: 24, isUnsigned: true)
!109 = !DIEnumerator(name: "CONTEXT_NO_ERROR", value: 25, isUnsigned: true)
!110 = !DIEnumerator(name: "FLOATBUFFERS", value: 26, isUnsigned: true)
!111 = !DIEnumerator(name: "EGL_PLATFORM", value: 27, isUnsigned: true)
!112 = !{i32 2, !"CodeView", i32 1}
!113 = !{i32 2, !"Debug Info Version", i32 3}
!114 = distinct !DISubprogram(name: "push_string", linkageName: "__io_push_string", scope: !17, file: !17, line: 9, type: !115, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117, !125}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[]u32", baseType: !118, size: 64, align: 64, dwarfAddressSpace: 0)
!118 = !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !17, size: 128, align: 64, elements: !119)
!119 = !{!120, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !17, file: !17, baseType: !121, size: 64, align: 64)
!121 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !123, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u32", baseType: !124, size: 64, align: 64, dwarfAddressSpace: 0)
!124 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !126, file: !126, size: 128, elements: !127)
!126 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!127 = !{!128, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !126, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!130 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !126, file: !126, baseType: !121, size: 64, align: 64, offset: 64)
!132 = !{}
!133 = !DILocation(line: 9, scope: !114)
!134 = !DILocalVariable(name: "b", scope: !114, file: !17, line: 9, type: !117)
!135 = !DILocalVariable(name: "to_push", arg: 1, scope: !114, file: !17, line: 9, type: !125)
!136 = !DILocation(line: 10, scope: !114)
!137 = !DILocalVariable(name: "c", scope: !114, file: !17, line: 10, type: !124)
!138 = !DILocalVariable(name: "i", scope: !114, file: !17, line: 10, type: !121)
!139 = !DILocation(line: 11, scope: !114)
!140 = !DILocation(line: 13, scope: !114)
!141 = distinct !DISubprogram(name: "format_uint", linkageName: "__io_format_uint", scope: !17, file: !17, line: 15, type: !142, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !117, !144}
!144 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!145 = !DILocation(line: 15, scope: !141)
!146 = !DILocalVariable(name: "b", scope: !141, file: !17, line: 15, type: !117)
!147 = !DILocalVariable(name: "num_in", arg: 1, scope: !141, file: !17, line: 15, type: !144)
!148 = !DILocation(line: 16, scope: !141)
!149 = !DILocalVariable(name: "temp", scope: !141, file: !17, line: 16, type: !150)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 8192, align: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 256, lowerBound: 0)
!153 = !DILocation(line: 17, scope: !141)
!154 = !DILocalVariable(name: "num", scope: !141, file: !17, line: 17, type: !144)
!155 = !DILocation(line: 18, scope: !141)
!156 = !DILocation(line: 19, scope: !141)
!157 = !DILocation(line: 20, scope: !141)
!158 = !DILocation(line: 23, scope: !141)
!159 = !DILocalVariable(name: "count", scope: !141, file: !17, line: 23, type: !121)
!160 = !DILocation(line: 24, scope: !141)
!161 = !DILocation(line: 25, scope: !141)
!162 = !DILocalVariable(name: "digit", scope: !141, file: !17, line: 25, type: !144)
!163 = !DILocation(line: 26, scope: !141)
!164 = !DILocation(line: 27, scope: !141)
!165 = !DILocalVariable(name: "c", scope: !141, file: !17, line: 27, type: !144)
!166 = !DILocation(line: 28, scope: !141)
!167 = !DILocation(line: 29, scope: !141)
!168 = !DILocation(line: 32, scope: !141)
!169 = !DILocalVariable(name: "i", scope: !141, file: !17, line: 32, type: !121)
!170 = !DILocation(line: 33, scope: !141)
!171 = !DILocation(line: 35, scope: !141)
!172 = distinct !DISubprogram(name: "format_int", linkageName: "__io_format_int", scope: !17, file: !17, line: 37, type: !173, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !117, !121}
!175 = !DILocation(line: 37, scope: !172)
!176 = !DILocalVariable(name: "b", scope: !172, file: !17, line: 37, type: !117)
!177 = !DILocalVariable(name: "num_in", arg: 1, scope: !172, file: !17, line: 37, type: !121)
!178 = !DILocation(line: 38, scope: !172)
!179 = !DILocalVariable(name: "temp", scope: !172, file: !17, line: 38, type: !150)
!180 = !DILocation(line: 39, scope: !172)
!181 = !DILocalVariable(name: "num", scope: !172, file: !17, line: 39, type: !121)
!182 = !DILocation(line: 40, scope: !172)
!183 = !DILocation(line: 41, scope: !172)
!184 = !DILocation(line: 42, scope: !172)
!185 = !DILocation(line: 45, scope: !172)
!186 = !DILocalVariable(name: "is_neg", scope: !172, file: !17, line: 45, type: !187)
!187 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!188 = !DILocation(line: 46, scope: !172)
!189 = !DILocation(line: 47, scope: !172)
!190 = !DILocation(line: 48, scope: !172)
!191 = !DILocation(line: 51, scope: !172)
!192 = !DILocalVariable(name: "count", scope: !172, file: !17, line: 51, type: !121)
!193 = !DILocation(line: 52, scope: !172)
!194 = !DILocation(line: 53, scope: !172)
!195 = !DILocalVariable(name: "digit", scope: !172, file: !17, line: 53, type: !121)
!196 = !DILocation(line: 54, scope: !172)
!197 = !DILocation(line: 55, scope: !172)
!198 = !DILocalVariable(name: "c", scope: !172, file: !17, line: 55, type: !124)
!199 = !DILocation(line: 56, scope: !172)
!200 = !DILocation(line: 57, scope: !172)
!201 = !DILocation(line: 60, scope: !172)
!202 = !DILocation(line: 62, scope: !172)
!203 = !DILocalVariable(name: "i", scope: !172, file: !17, line: 62, type: !121)
!204 = !DILocation(line: 63, scope: !172)
!205 = !DILocation(line: 65, scope: !172)
!206 = distinct !DISubprogram(name: "print_typetype", linkageName: "__io_print_typetype", scope: !17, file: !17, line: 127, type: !207, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !117, !209}
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !17, file: !17, size: 384, elements: !210)
!210 = !{!211, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, baseType: !212, size: 64, align: 64)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !126, file: !126, size: 64, align: 64, elements: !20)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !214, size: 320, align: 64, offset: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !17, file: !17, size: 320, elements: !215)
!215 = !{!216, !224, !239, !248, !253, !258, !261, !271, !277}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !17, file: !17, baseType: !217, size: 256, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !17, file: !17, size: 256, elements: !218)
!218 = !{!219, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, baseType: !220, size: 64, align: 64)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !126, file: !126, size: 64, align: 64, elements: !32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !17, baseType: !124, size: 32, align: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !17, file: !17, baseType: !124, size: 32, align: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !17, baseType: !125, size: 128, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !17, file: !17, baseType: !225, size: 320, align: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !17, file: !17, size: 320, elements: !226)
!226 = !{!227, !223, !238}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !17, file: !17, baseType: !228, size: 128, align: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !126, size: 128, align: 64, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !126, file: !126, baseType: !121, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !126, baseType: !232, size: 64, align: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !233, size: 64, align: 64, dwarfAddressSpace: 0)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !126, file: !126, size: 192, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !126, baseType: !125, size: 128, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !126, file: !126, baseType: !237, size: 64, align: 64, offset: 128)
!237 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !17, file: !17, baseType: !124, size: 32, align: 32, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !17, file: !17, baseType: !240, size: 192, align: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !17, file: !17, size: 192, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !17, file: !17, baseType: !237, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !17, file: !17, baseType: !244, size: 128, align: 64, offset: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !126, size: 128, align: 64, elements: !245)
!245 = !{!230, !246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !126, baseType: !247, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !237, size: 64, align: 64, dwarfAddressSpace: 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !17, file: !17, baseType: !249, size: 128, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !17, file: !17, size: 128, elements: !250)
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !17, file: !17, baseType: !237, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !17, file: !17, baseType: !187, size: 8, align: 8, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !17, file: !17, baseType: !254, size: 128, align: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !17, file: !17, size: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !237, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !17, file: !17, baseType: !124, size: 32, align: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !17, file: !17, baseType: !259, size: 64, align: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !17, file: !17, size: 64, elements: !260)
!260 = !{!256}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !17, file: !17, baseType: !262, size: 320, align: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !17, file: !17, size: 320, elements: !263)
!263 = !{!264, !265, !270}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !17, baseType: !125, size: 128, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !17, file: !17, baseType: !266, size: 128, align: 64, offset: 128)
!266 = !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !126, size: 128, align: 64, elements: !267)
!267 = !{!230, !268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !126, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !237, size: 64, align: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !17, file: !17, baseType: !272, size: 128, align: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !17, file: !17, size: 128, elements: !273)
!273 = !{!274, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !17, file: !17, baseType: !275, size: 64, align: 64)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !126, file: !126, size: 64, align: 64, elements: !67)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !17, file: !17, baseType: !124, size: 32, align: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !17, file: !17, baseType: !278, size: 128, align: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !17, file: !17, size: 128, elements: !279)
!279 = !{!264}
!280 = !DILocation(line: 127, scope: !206)
!281 = !DILocalVariable(name: "b", scope: !206, file: !17, line: 127, type: !117)
!282 = !DILocalVariable(name: "info", arg: 1, scope: !206, file: !17, line: 127, type: !209)
!283 = !DILocation(line: 128, scope: !206)
!284 = !DILocation(line: 130, scope: !206)
!285 = !DILocation(line: 133, scope: !206)
!286 = !DILocation(line: 136, scope: !206)
!287 = !DILocation(line: 137, scope: !206)
!288 = !DILocalVariable(name: "args", scope: !206, file: !17, line: 137, type: !244)
!289 = !DILocation(line: 138, scope: !206)
!290 = !DILocalVariable(name: "arg", scope: !206, file: !17, line: 138, type: !237)
!291 = !DILocalVariable(name: "i", scope: !206, file: !17, line: 138, type: !121)
!292 = !DILocation(line: 139, scope: !206)
!293 = !DILocation(line: 140, scope: !206)
!294 = !DILocation(line: 141, scope: !206)
!295 = !DILocation(line: 144, scope: !206)
!296 = !DILocation(line: 145, scope: !206)
!297 = !DILocation(line: 146, scope: !206)
!298 = !DILocation(line: 147, scope: !206)
!299 = !DILocation(line: 151, scope: !206)
!300 = !DILocation(line: 154, scope: !206)
!301 = !DILocation(line: 155, scope: !206)
!302 = !DILocation(line: 158, scope: !206)
!303 = !DILocation(line: 159, scope: !206)
!304 = !DILocation(line: 162, scope: !206)
!305 = !DILocation(line: 163, scope: !206)
!306 = !DILocation(line: 166, scope: !206)
!307 = !DILocation(line: 169, scope: !206)
!308 = !DILocation(line: 172, scope: !206)
!309 = !DILocation(line: 176, scope: !206)
!310 = distinct !DISubprogram(name: "print_type", linkageName: "__io_print_type", scope: !17, file: !17, line: 178, type: !311, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !117, !313}
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_Arg", scope: !17, file: !17, size: 128, elements: !314)
!314 = !{!256, !315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !17, file: !17, baseType: !316, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*void", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!317 = !DILocation(line: 178, scope: !310)
!318 = !DILocalVariable(name: "b", scope: !310, file: !17, line: 178, type: !117)
!319 = !DILocalVariable(name: "arg", arg: 1, scope: !310, file: !17, line: 178, type: !313)
!320 = !DILocation(line: 179, scope: !310)
!321 = !DILocalVariable(name: "t", scope: !310, file: !17, line: 179, type: !209)
!322 = !DILocation(line: 180, scope: !310)
!323 = !DILocation(line: 184, scope: !310)
!324 = !DILocalVariable(name: "basic", scope: !310, file: !17, line: 184, type: !217)
!325 = !DILocation(line: 185, scope: !310)
!326 = !DILocation(line: 186, scope: !310)
!327 = !DILocation(line: 187, scope: !310)
!328 = !DILocation(line: 189, scope: !310)
!329 = !DILocation(line: 192, scope: !310)
!330 = !DILocation(line: 193, scope: !310)
!331 = !DILocalVariable(name: "str", scope: !310, file: !17, line: 193, type: !125)
!332 = !DILocation(line: 194, scope: !310)
!333 = !DILocation(line: 203, scope: !310)
!334 = !DILocation(line: 204, scope: !310)
!335 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 204, type: !144)
!336 = !DILocation(line: 205, scope: !310)
!337 = !DILocation(line: 207, scope: !310)
!338 = !DILocation(line: 208, scope: !310)
!339 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 208, type: !144)
!340 = !DILocation(line: 209, scope: !310)
!341 = !DILocation(line: 211, scope: !310)
!342 = !DILocation(line: 212, scope: !310)
!343 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 212, type: !144)
!344 = !DILocation(line: 213, scope: !310)
!345 = !DILocation(line: 215, scope: !310)
!346 = !DILocation(line: 216, scope: !310)
!347 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 216, type: !144)
!348 = !DILocation(line: 217, scope: !310)
!349 = !DILocation(line: 219, scope: !310)
!350 = !DILocation(line: 220, scope: !310)
!351 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 220, type: !121)
!352 = !DILocation(line: 221, scope: !310)
!353 = !DILocation(line: 223, scope: !310)
!354 = !DILocation(line: 224, scope: !310)
!355 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 224, type: !121)
!356 = !DILocation(line: 225, scope: !310)
!357 = !DILocation(line: 227, scope: !310)
!358 = !DILocation(line: 228, scope: !310)
!359 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 228, type: !121)
!360 = !DILocation(line: 229, scope: !310)
!361 = !DILocation(line: 231, scope: !310)
!362 = !DILocation(line: 232, scope: !310)
!363 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 232, type: !121)
!364 = !DILocation(line: 233, scope: !310)
!365 = !DILocation(line: 235, scope: !310)
!366 = !DILocation(line: 236, scope: !310)
!367 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 236, type: !121)
!368 = !DILocation(line: 237, scope: !310)
!369 = !DILocation(line: 239, scope: !310)
!370 = !DILocation(line: 240, scope: !310)
!371 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 240, type: !144)
!372 = !DILocation(line: 241, scope: !310)
!373 = !DILocation(line: 243, scope: !310)
!374 = !DILocation(line: 244, scope: !310)
!375 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 244, type: !376)
!376 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!377 = !DILocation(line: 245, scope: !310)
!378 = !DILocation(line: 247, scope: !310)
!379 = !DILocation(line: 248, scope: !310)
!380 = !DILocalVariable(name: "num", scope: !310, file: !17, line: 248, type: !381)
!381 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!382 = !DILocation(line: 249, scope: !310)
!383 = !DILocation(line: 251, scope: !310)
!384 = !DILocation(line: 252, scope: !310)
!385 = !DILocalVariable(name: "pt", scope: !310, file: !17, line: 252, type: !237)
!386 = !DILocation(line: 253, scope: !310)
!387 = !DILocalVariable(name: "info", scope: !310, file: !17, line: 253, type: !209)
!388 = !DILocation(line: 254, scope: !310)
!389 = !DILocation(line: 257, scope: !310)
!390 = !DILocation(line: 263, scope: !310)
!391 = !DILocalVariable(name: "st", scope: !310, file: !17, line: 263, type: !225)
!392 = !DILocation(line: 264, scope: !310)
!393 = !DILocation(line: 265, scope: !310)
!394 = !DILocation(line: 266, scope: !310)
!395 = !DILocalVariable(name: "n", scope: !310, file: !17, line: 266, type: !121)
!396 = !DILocation(line: 267, scope: !310)
!397 = !DILocalVariable(name: "m", scope: !310, file: !17, line: 267, type: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !17, file: !17, size: 192, elements: !399)
!399 = !{!264, !400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !17, file: !17, baseType: !237, size: 64, align: 64, offset: 128)
!401 = !DILocation(line: 268, scope: !310)
!402 = !DILocation(line: 269, scope: !310)
!403 = !DILocation(line: 270, scope: !310)
!404 = !DILocation(line: 271, scope: !310)
!405 = !DILocalVariable(name: "ptr", scope: !310, file: !17, line: 271, type: !129)
!406 = !DILocation(line: 272, scope: !310)
!407 = !DILocalVariable(name: "offset", scope: !310, file: !17, line: 272, type: !121)
!408 = !DILocation(line: 273, scope: !310)
!409 = !DILocalVariable(name: "mem_arg", scope: !310, file: !17, line: 273, type: !313)
!410 = !DILocation(line: 277, scope: !310)
!411 = !DILocation(line: 279, scope: !310)
!412 = !DILocation(line: 280, scope: !310)
!413 = !DILocation(line: 281, scope: !310)
!414 = !DILocation(line: 284, scope: !310)
!415 = !DILocation(line: 299, scope: !310)
!416 = distinct !DISubprogram(name: "builder_to_string", linkageName: "__io_builder_to_string", scope: !17, file: !17, line: 301, type: !417, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!417 = !DISubroutineType(types: !418)
!418 = !{!419, !117}
!419 = !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !17, size: 128, align: 64, elements: !420)
!420 = !{!120, !421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !129, size: 64, align: 64, offset: 64)
!422 = !DILocation(line: 301, scope: !416)
!423 = !DILocalVariable(name: "b_in", scope: !416, file: !17, line: 301, type: !117)
!424 = !DILocation(line: 302, scope: !416)
!425 = !DILocalVariable(name: "b", scope: !416, file: !17, line: 302, type: !117)
!426 = !DILocation(line: 303, scope: !416)
!427 = !DILocalVariable(name: "alloc", scope: !416, file: !17, line: 303, type: !428)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !17, file: !17, size: 192, elements: !429)
!429 = !{!430, !436, !440}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !17, file: !17, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(int, *__mem_Allocator) -> ?*", baseType: !432, size: 64, align: 64, dwarfAddressSpace: 0)
!432 = !DISubroutineType(types: !433)
!433 = !{!316, !121, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__mem_Allocator", baseType: !435, size: 64, align: 64, dwarfAddressSpace: 0)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !126, file: !126, size: 192, align: 64, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !17, file: !17, baseType: !437, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(*, *__mem_Allocator)", baseType: !438, size: 64, align: 64, dwarfAddressSpace: 0)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !316, !434}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !316, size: 64, align: 64, offset: 128)
!441 = !DILocation(line: 304, scope: !416)
!442 = !DILocalVariable(name: "res", scope: !416, file: !17, line: 304, type: !419)
!443 = !DILocation(line: 306, scope: !416)
!444 = !DILocalVariable(name: "i", scope: !416, file: !17, line: 306, type: !121)
!445 = !DILocation(line: 307, scope: !416)
!446 = !DILocalVariable(name: "ptr", scope: !416, file: !17, line: 307, type: !129)
!447 = !DILocation(line: 308, scope: !416)
!448 = !DILocation(line: 309, scope: !416)
!449 = !DILocation(line: 310, scope: !416)
!450 = !DILocation(line: 313, scope: !416)
!451 = !DILocalVariable(name: "size", scope: !416, file: !17, line: 313, type: !121)
!452 = !DILocation(line: 314, scope: !416)
!453 = !DILocalVariable(name: "j", scope: !416, file: !17, line: 314, type: !121)
!454 = !DILocation(line: 315, scope: !416)
!455 = !DILocation(line: 319, scope: !416)
!456 = distinct !DISubprogram(name: "print_type_with_formatter", linkageName: "__io_print_type_with_formatter", scope: !17, file: !17, line: 322, type: !457, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !117, !124, !313}
!459 = !DILocation(line: 322, scope: !456)
!460 = !DILocalVariable(name: "b", scope: !456, file: !17, line: 322, type: !117)
!461 = !DILocalVariable(name: "c", arg: 1, scope: !456, file: !17, line: 322, type: !124)
!462 = !DILocalVariable(name: "arg", arg: 2, scope: !456, file: !17, line: 322, type: !313)
!463 = !DILocation(line: 323, scope: !456)
!464 = !DILocalVariable(name: "t", scope: !456, file: !17, line: 323, type: !209)
!465 = !DILocation(line: 324, scope: !456)
!466 = !DILocation(line: 325, scope: !456)
!467 = !DILocalVariable(name: "str", scope: !456, file: !17, line: 325, type: !129)
!468 = !DILocation(line: 326, scope: !456)
!469 = !DILocalVariable(name: "i", scope: !456, file: !17, line: 326, type: !121)
!470 = !DILocation(line: 327, scope: !456)
!471 = !DILocation(line: 330, scope: !456)
!472 = !DILocation(line: 331, scope: !456)
!473 = !DILocation(line: 333, scope: !456)
!474 = distinct !DISubprogram(name: "__internal_print", linkageName: "__io___internal_print", scope: !17, file: !17, line: 335, type: !475, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!475 = !DISubroutineType(types: !476)
!476 = !{!118, !125, !477}
!477 = !DICompositeType(tag: DW_TAG_structure_type, scope: !17, file: !17, size: 128, align: 64, elements: !478)
!478 = !{!120, !479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !17, baseType: !480, size: 64, align: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_Arg", baseType: !313, size: 64, align: 64, dwarfAddressSpace: 0)
!481 = !DILocation(line: 335, scope: !474)
!482 = !DILocalVariable(name: "fmt", scope: !474, file: !17, line: 335, type: !125)
!483 = !DILocalVariable(name: "args", arg: 1, scope: !474, file: !17, line: 335, type: !477)
!484 = !DILocation(line: 336, scope: !474)
!485 = !DILocalVariable(name: "alloc", scope: !474, file: !17, line: 336, type: !428)
!486 = !DILocation(line: 337, scope: !474)
!487 = !DILocalVariable(name: "builder", scope: !474, file: !17, line: 337, type: !118)
!488 = !DILocation(line: 338, scope: !474)
!489 = !DILocalVariable(name: "arg_count", scope: !474, file: !17, line: 338, type: !121)
!490 = !DILocation(line: 339, scope: !474)
!491 = !DILocalVariable(name: "need_to_print_arg", scope: !474, file: !17, line: 339, type: !187)
!492 = !DILocation(line: 340, scope: !474)
!493 = !DILocalVariable(name: "c", scope: !474, file: !17, line: 340, type: !124)
!494 = !DILocalVariable(name: "i", scope: !474, file: !17, line: 340, type: !121)
!495 = !DILocation(line: 341, scope: !474)
!496 = !DILocation(line: 342, scope: !474)
!497 = !DILocation(line: 344, scope: !474)
!498 = !DILocation(line: 345, scope: !474)
!499 = !DILocalVariable(name: "arg", scope: !474, file: !17, line: 345, type: !313)
!500 = !DILocation(line: 346, scope: !474)
!501 = !DILocation(line: 347, scope: !474)
!502 = !DILocation(line: 348, scope: !474)
!503 = !DILocation(line: 350, scope: !474)
!504 = !DILocation(line: 355, scope: !474)
!505 = !DILocation(line: 356, scope: !474)
!506 = !DILocalVariable(name: "arg", scope: !474, file: !17, line: 356, type: !313)
!507 = !DILocation(line: 357, scope: !474)
!508 = !DILocation(line: 358, scope: !474)
!509 = !DILocation(line: 359, scope: !474)
!510 = !DILocation(line: 362, scope: !474)
!511 = distinct !DISubprogram(name: "print", linkageName: "__io_print", scope: !17, file: !17, line: 365, type: !512, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !125}
!514 = !DILocation(line: 365, scope: !511)
!515 = !DILocalVariable(name: "str", scope: !511, file: !17, line: 365, type: !125)
!516 = !DILocalVariable(name: "args", arg: 1, scope: !511, file: !17, line: 365, type: !477)
!517 = !DILocation(line: 366, scope: !511)
!518 = !DILocalVariable(name: "builder", scope: !511, file: !17, line: 366, type: !118)
!519 = !DILocation(line: 367, scope: !511)
!520 = !DILocalVariable(name: "res", scope: !511, file: !17, line: 367, type: !419)
!521 = !DILocation(line: 368, scope: !511)
!522 = !DILocation(line: 369, scope: !511)
!523 = !DILocation(line: 370, scope: !511)
!524 = !DILocation(line: 371, scope: !511)
!525 = distinct !DISubprogram(name: "println", linkageName: "__io_println", scope: !17, file: !17, line: 373, type: !512, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!526 = !DILocation(line: 373, scope: !525)
!527 = !DILocalVariable(name: "str", scope: !525, file: !17, line: 373, type: !125)
!528 = !DILocalVariable(name: "args", arg: 1, scope: !525, file: !17, line: 373, type: !477)
!529 = !DILocation(line: 374, scope: !525)
!530 = !DILocalVariable(name: "builder", scope: !525, file: !17, line: 374, type: !118)
!531 = !DILocation(line: 375, scope: !525)
!532 = !DILocation(line: 376, scope: !525)
!533 = !DILocalVariable(name: "res", scope: !525, file: !17, line: 376, type: !419)
!534 = !DILocation(line: 377, scope: !525)
!535 = !DILocation(line: 378, scope: !525)
!536 = !DILocation(line: 379, scope: !525)
!537 = !DILocation(line: 381, scope: !525)
!538 = distinct !DISubprogram(name: "get_next", linkageName: "__io_get_next", scope: !17, file: !17, line: 383, type: !539, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !132)
!539 = !DISubroutineType(types: !540)
!540 = !{!124, !129}
