; ModuleID = 'io'
source_filename = "io.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.523 = type { i64, ptr }
%string.461 = type { ptr, i64 }
%__init_TypeInfo.474 = type { i64, %__init_TypeUnion.473 }
%__init_TypeUnion.473 = type { %__init_StructType.465 }
%__init_StructType.465 = type { %slice.518, %string.461, i32 }
%slice.518 = type { i64, ptr }
%slice.519 = type { i64, ptr }
%__init_BasicType.463 = type { i64, i32, i32, %string.461 }
%__init_FunctionType.466 = type { i64, %slice.519 }
%__init_PointerType.467 = type { i64, i1 }
%__init_ArrayType.468 = type { i64, i32 }
%__init_SliceType.469 = type { i64 }
%__init_EnumType.470 = type { %string.461, %slice.520, i64 }
%slice.520 = type { i64, ptr }
%__init_GenericType.472 = type { %string.461 }
%__init_Arg.462 = type { i64, ptr }
%__init_StructMember.464 = type { %string.461, i64 }
%slice.526 = type { i64, ptr }
%__mem_Allocator.476 = type { ptr, ptr, ptr }
%slice.525 = type { i64, ptr }
%slice.524 = type { i64, ptr }

$___asan_gen__anon_global = comdat nodeduplicate

$___asan_gen__anon_global.21 = comdat nodeduplicate

$___asan_gen__anon_global.23 = comdat nodeduplicate

$___asan_gen__anon_global.25 = comdat nodeduplicate

$___asan_gen__anon_global.27 = comdat nodeduplicate

$___asan_gen__anon_global.29 = comdat nodeduplicate

$___asan_gen__anon_global.31 = comdat nodeduplicate


!47 = !DIEnumerator(name: "untypedInteger", value: 12, isUnsigned: true)
!48 = !DIEnumerator(name: "untypedFloat", value: 13, isUnsigned: true)
!49 = !DIEnumerator(name: "Int", value: 14, isUnsigned: true)
!50 = !DIEnumerator(name: "Uint", value: 15, isUnsigned: true)
!51 = !DIEnumerator(name: "Type", value: 16, isUnsigned: true)
!52 = !DIEnumerator(name: "Auto", value: 17, isUnsigned: true)
!53 = !DIEnumerator(name: "Module", value: 18, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicFlag", scope: !19, file: !19, size: 32, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62}
!56 = !DIEnumerator(name: "Boolean", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "Integer", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "Float", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "String", value: 8, isUnsigned: true)
!60 = !DIEnumerator(name: "Untyped", value: 32, isUnsigned: true)
!61 = !DIEnumerator(name: "Unsigned", value: 64, isUnsigned: true)
!62 = !DIEnumerator(name: "TypeID", value: 128, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_StructFlag", scope: !19, file: !19, size: 32, align: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "Packed", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "Generic", value: 2, isUnsigned: true)
!67 = !DIEnumerator(name: "Union", value: 4, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !19, file: !19, size: 64, align: 64, elements: !69)
!69 = !{!70, !71}
!70 = !DIEnumerator(name: "Float", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "Int", value: 1, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__compile_CompileFlag", scope: !19, file: !19, size: 32, align: 32, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "Debug", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "SanAddress", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "SanMemory", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "SanThread", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "SanUndefined", value: 16, isUnsigned: true)
!79 = !DIEnumerator(name: "NoStdLib", value: 32, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !19, file: !19, size: 32, align: 32, elements: !81)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIEnumerator(name: "FIRST", value: 0)
!83 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!84 = !DIEnumerator(name: "MOUSE_MOTION", value: 1024, isUnsigned: true)
!85 = !DIEnumerator(name: "MOUSE_BUTTON_DOWN", value: 1025, isUnsigned: true)
!86 = !DIEnumerator(name: "MOUSE_BUTTON_UP", value: 1026, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_GLattr", scope: !19, file: !19, size: 32, align: 32, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!89 = !DIEnumerator(name: "RED_SIZE", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "GREEN_SIZE", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "BLUE_SIZE", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "ALPHA_SIZE", value: 3, isUnsigned: true)
!93 = !DIEnumerator(name: "BUFFER_SIZE", value: 4, isUnsigned: true)
!94 = !DIEnumerator(name: "DOUBLEBUFFER", value: 5, isUnsigned: true)
!95 = !DIEnumerator(name: "DEPTH_SIZE", value: 6, isUnsigned: true)
!96 = !DIEnumerator(name: "STENCIL_SIZE", value: 7, isUnsigned: true)
!97 = !DIEnumerator(name: "ACCUM_RED_SIZE", value: 8, isUnsigned: true)
!98 = !DIEnumerator(name: "ACCUM_GREEN_SIZE", value: 9, isUnsigned: true)
!99 = !DIEnumerator(name: "ACCUM_BLUE_SIZE", value: 10, isUnsigned: true)
!100 = !DIEnumerator(name: "ACCUM_ALPHA_SIZE", value: 11, isUnsigned: true)
!101 = !DIEnumerator(name: "STEREO", value: 12, isUnsigned: true)
!102 = !DIEnumerator(name: "MULTISAMPLEBUFFERS", value: 13, isUnsigned: true)
!103 = !DIEnumerator(name: "MULTISAMPLESAMPLES", value: 14, isUnsigned: true)
!104 = !DIEnumerator(name: "ACCELERATED_VISUAL", value: 15, isUnsigned: true)
!105 = !DIEnumerator(name: "RETAINED_BACKING", value: 16, isUnsigned: true)
!106 = !DIEnumerator(name: "CONTEXT_MAJOR_VERSION", value: 17, isUnsigned: true)
!107 = !DIEnumerator(name: "CONTEXT_MINOR_VERSION", value: 18, isUnsigned: true)
!108 = !DIEnumerator(name: "CONTEXT_FLAGS", value: 19, isUnsigned: true)
!109 = !DIEnumerator(name: "CONTEXT_PROFILE_MASK", value: 20, isUnsigned: true)
!110 = !DIEnumerator(name: "SHARE_WITH_CURRENT_CONTEXT", value: 21, isUnsigned: true)
!111 = !DIEnumerator(name: "FRAMEBUFFER_SRGB_CAPABLE", value: 22, isUnsigned: true)
!112 = !DIEnumerator(name: "CONTEXT_RELEASE_BEHAVIOR", value: 23, isUnsigned: true)
!113 = !DIEnumerator(name: "CONTEXT_RESET_NOTIFICATION", value: 24, isUnsigned: true)
!114 = !DIEnumerator(name: "CONTEXT_NO_ERROR", value: 25, isUnsigned: true)
!115 = !DIEnumerator(name: "FLOATBUFFERS", value: 26, isUnsigned: true)
!116 = !DIEnumerator(name: "EGL_PLATFORM", value: 27, isUnsigned: true)
!117 = !{i32 2, !"CodeView", i32 1}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = distinct !DISubprogram(name: "push_string", linkageName: "__io_push_string", scope: !19, file: !19, line: 9, type: !120, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122, !130}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[]u32", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!123 = !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !19, size: 128, align: 64, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !19, file: !19, baseType: !126, size: 64, align: 64)
!126 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !19, baseType: !128, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u32", baseType: !129, size: 64, align: 64, dwarfAddressSpace: 0)
!129 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", scope: !131, file: !131, size: 128, elements: !132)
!131 = !DIFile(filename: "main.rcp", directory: "E:\\Non_C_Projects\\RCPProjects\\graph\\src")
!132 = !{!133, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !131, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !135, size: 64, align: 64, dwarfAddressSpace: 0)
!135 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !131, file: !131, baseType: !126, size: 64, align: 64, offset: 64)
!137 = !{}
!138 = !DILocation(line: 9, scope: !119)
!139 = !DILocalVariable(name: "b", scope: !119, file: !19, line: 9, type: !122)
!140 = !DILocalVariable(name: "to_push", arg: 1, scope: !119, file: !19, line: 9, type: !130)
!141 = !DILocation(line: 10, scope: !119)
!142 = !DILocalVariable(name: "c", scope: !119, file: !19, line: 10, type: !129)
!143 = !DILocalVariable(name: "i", scope: !119, file: !19, line: 10, type: !126)
!144 = !DILocation(line: 11, scope: !119)
!145 = !DILocation(line: 13, scope: !119)
!146 = distinct !DISubprogram(name: "format_uint", linkageName: "__io_format_uint", scope: !19, file: !19, line: 15, type: !147, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !122, !149}
!149 = !DIBasicType(name: "uint", size: 64, encoding: DW_ATE_unsigned)
!150 = !DILocation(line: 15, scope: !146)
!151 = !DILocalVariable(name: "b", scope: !146, file: !19, line: 15, type: !122)
!152 = !DILocalVariable(name: "num_in", arg: 1, scope: !146, file: !19, line: 15, type: !149)
!153 = !DILocation(line: 16, scope: !146)
!154 = !DILocalVariable(name: "temp", scope: !146, file: !19, line: 16, type: !155)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 8192, align: 32, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 256, lowerBound: 0)
!158 = !DILocation(line: 17, scope: !146)
!159 = !DILocalVariable(name: "num", scope: !146, file: !19, line: 17, type: !149)
!160 = !DILocation(line: 18, scope: !146)
!161 = !DILocation(line: 19, scope: !146)
!162 = !DILocation(line: 20, scope: !146)
!163 = !DILocation(line: 23, scope: !146)
!164 = !DILocalVariable(name: "count", scope: !146, file: !19, line: 23, type: !126)
!165 = !DILocation(line: 24, scope: !146)
!166 = !DILocation(line: 25, scope: !146)
!167 = !DILocalVariable(name: "digit", scope: !146, file: !19, line: 25, type: !149)
!168 = !DILocation(line: 26, scope: !146)
!169 = !DILocation(line: 27, scope: !146)
!170 = !DILocalVariable(name: "c", scope: !146, file: !19, line: 27, type: !149)
!171 = !DILocation(line: 28, scope: !146)
!172 = !DILocation(line: 29, scope: !146)
!173 = !DILocation(line: 32, scope: !146)
!174 = !DILocalVariable(name: "i", scope: !146, file: !19, line: 32, type: !126)
!175 = !DILocation(line: 33, scope: !146)
!176 = !DILocation(line: 35, scope: !146)
!177 = distinct !DISubprogram(name: "format_int", linkageName: "__io_format_int", scope: !19, file: !19, line: 37, type: !178, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !122, !126}
!180 = !DILocation(line: 37, scope: !177)
!181 = !DILocalVariable(name: "b", scope: !177, file: !19, line: 37, type: !122)
!182 = !DILocalVariable(name: "num_in", arg: 1, scope: !177, file: !19, line: 37, type: !126)
!183 = !DILocation(line: 38, scope: !177)
!184 = !DILocalVariable(name: "temp", scope: !177, file: !19, line: 38, type: !155)
!185 = !DILocation(line: 39, scope: !177)
!186 = !DILocalVariable(name: "num", scope: !177, file: !19, line: 39, type: !126)
!187 = !DILocation(line: 40, scope: !177)
!188 = !DILocation(line: 41, scope: !177)
!189 = !DILocation(line: 42, scope: !177)
!190 = !DILocation(line: 45, scope: !177)
!191 = !DILocalVariable(name: "is_neg", scope: !177, file: !19, line: 45, type: !192)
!192 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!193 = !DILocation(line: 46, scope: !177)
!194 = !DILocation(line: 47, scope: !177)
!195 = !DILocation(line: 48, scope: !177)
!196 = !DILocation(line: 51, scope: !177)
!197 = !DILocalVariable(name: "count", scope: !177, file: !19, line: 51, type: !126)
!198 = !DILocation(line: 52, scope: !177)
!199 = !DILocation(line: 53, scope: !177)
!200 = !DILocalVariable(name: "digit", scope: !177, file: !19, line: 53, type: !126)
!201 = !DILocation(line: 54, scope: !177)
!202 = !DILocation(line: 55, scope: !177)
!203 = !DILocalVariable(name: "c", scope: !177, file: !19, line: 55, type: !129)
!204 = !DILocation(line: 56, scope: !177)
!205 = !DILocation(line: 57, scope: !177)
!206 = !DILocation(line: 60, scope: !177)
!207 = !DILocation(line: 62, scope: !177)
!208 = !DILocalVariable(name: "i", scope: !177, file: !19, line: 62, type: !126)
!209 = !DILocation(line: 63, scope: !177)
!210 = !DILocation(line: 65, scope: !177)
!211 = distinct !DISubprogram(name: "print_typetype", linkageName: "__io_print_typetype", scope: !19, file: !19, line: 127, type: !212, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !122, !214}
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeInfo", scope: !19, file: !19, size: 384, elements: !215)
!215 = !{!216, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !19, file: !19, baseType: !217, size: 64, align: 64)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_TypeKind", scope: !131, file: !131, size: 64, align: 64, elements: !22)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !19, file: !19, baseType: !219, size: 320, align: 64, offset: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_TypeUnion", scope: !19, file: !19, size: 320, elements: !220)
!220 = !{!221, !229, !244, !253, !258, !263, !266, !276, !282}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !19, file: !19, baseType: !222, size: 256, align: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_BasicType", scope: !19, file: !19, size: 256, elements: !223)
!223 = !{!224, !226, !227, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !19, file: !19, baseType: !225, size: 64, align: 64)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_BasicKind", scope: !131, file: !131, size: 64, align: 64, elements: !34)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !19, file: !19, baseType: !129, size: 32, align: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !19, file: !19, baseType: !129, size: 32, align: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !19, baseType: !130, size: 128, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "struct_", scope: !19, file: !19, baseType: !230, size: 320, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructType", scope: !19, file: !19, size: 320, elements: !231)
!231 = !{!232, !228, !243}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !19, file: !19, baseType: !233, size: 128, align: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !131, size: 128, align: 64, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !131, file: !131, baseType: !126, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !131, baseType: !237, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_StructMember", baseType: !238, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !131, file: !131, size: 192, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !131, baseType: !130, size: 128, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !131, file: !131, baseType: !242, size: 64, align: 64, offset: 128)
!242 = !DIBasicType(name: "type", size: 64, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !19, file: !19, baseType: !129, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !19, file: !19, baseType: !245, size: 192, align: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_FunctionType", scope: !19, file: !19, size: 192, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "return_", scope: !19, file: !19, baseType: !242, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "args_t", scope: !19, file: !19, baseType: !249, size: 128, align: 64, offset: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !131, size: 128, align: 64, elements: !250)
!250 = !{!235, !251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !131, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*type", baseType: !242, size: 64, align: 64, dwarfAddressSpace: 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !19, file: !19, baseType: !254, size: 128, align: 64)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_PointerType", scope: !19, file: !19, size: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pointee", scope: !19, file: !19, baseType: !242, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_optional", scope: !19, file: !19, baseType: !192, size: 8, align: 8, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !19, file: !19, baseType: !259, size: 128, align: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_ArrayType", scope: !19, file: !19, size: 128, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !19, file: !19, baseType: !242, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "member_count", scope: !19, file: !19, baseType: !129, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !19, file: !19, baseType: !264, size: 64, align: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_SliceType", scope: !19, file: !19, size: 64, elements: !265)
!265 = !{!261}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enum_", scope: !19, file: !19, baseType: !267, size: 320, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_EnumType", scope: !19, file: !19, size: 320, elements: !268)
!268 = !{!269, !270, !275}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !19, baseType: !130, size: 128, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "member_names", scope: !19, file: !19, baseType: !271, size: 128, align: 64, offset: 128)
!271 = !DICompositeType(tag: DW_TAG_structure_type, scope: !131, file: !131, size: 128, align: 64, elements: !272)
!272 = !{!235, !273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !131, baseType: !274, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*string", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !19, file: !19, baseType: !242, size: 64, align: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !19, file: !19, baseType: !277, size: 128, align: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_VectorType", scope: !19, file: !19, size: 128, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !19, file: !19, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__init_VectorKind", scope: !131, file: !131, size: 64, align: 64, elements: !69)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "elem_count", scope: !19, file: !19, baseType: !129, size: 32, align: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !19, file: !19, baseType: !283, size: 128, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_GenericType", scope: !19, file: !19, size: 128, elements: !284)
!284 = !{!269}
!285 = !DILocation(line: 127, scope: !211)
!286 = !DILocalVariable(name: "b", scope: !211, file: !19, line: 127, type: !122)
!287 = !DILocalVariable(name: "info", arg: 1, scope: !211, file: !19, line: 127, type: !214)
!288 = !DILocation(line: 128, scope: !211)
!289 = !DILocation(line: 130, scope: !211)
!290 = !DILocation(line: 133, scope: !211)
!291 = !DILocation(line: 136, scope: !211)
!292 = !DILocation(line: 137, scope: !211)
!293 = !DILocalVariable(name: "args", scope: !211, file: !19, line: 137, type: !249)
!294 = !DILocation(line: 138, scope: !211)
!295 = !DILocalVariable(name: "arg", scope: !211, file: !19, line: 138, type: !242)
!296 = !DILocalVariable(name: "i", scope: !211, file: !19, line: 138, type: !126)
!297 = !DILocation(line: 139, scope: !211)
!298 = !DILocation(line: 140, scope: !211)
!299 = !DILocation(line: 141, scope: !211)
!300 = !DILocation(line: 144, scope: !211)
!301 = !DILocation(line: 145, scope: !211)
!302 = !DILocation(line: 146, scope: !211)
!303 = !DILocation(line: 147, scope: !211)
!304 = !DILocation(line: 151, scope: !211)
!305 = !DILocation(line: 154, scope: !211)
!306 = !DILocation(line: 155, scope: !211)
!307 = !DILocation(line: 158, scope: !211)
!308 = !DILocation(line: 159, scope: !211)
!309 = !DILocation(line: 162, scope: !211)
!310 = !DILocation(line: 163, scope: !211)
!311 = !DILocation(line: 166, scope: !211)
!312 = !DILocation(line: 169, scope: !211)
!313 = !DILocation(line: 172, scope: !211)
!314 = !DILocation(line: 176, scope: !211)
!315 = distinct !DISubprogram(name: "print_type", linkageName: "__io_print_type", scope: !19, file: !19, line: 178, type: !316, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !122, !318}
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_Arg", scope: !19, file: !19, size: 128, elements: !319)
!319 = !{!261, !320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !19, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*void", baseType: null, size: 64, align: 64, dwarfAddressSpace: 0)
!322 = !DILocation(line: 178, scope: !315)
!323 = !DILocalVariable(name: "b", scope: !315, file: !19, line: 178, type: !122)
!324 = !DILocalVariable(name: "arg", arg: 1, scope: !315, file: !19, line: 178, type: !318)
!325 = !DILocation(line: 179, scope: !315)
!326 = !DILocalVariable(name: "t", scope: !315, file: !19, line: 179, type: !214)
!327 = !DILocation(line: 180, scope: !315)
!328 = !DILocation(line: 184, scope: !315)
!329 = !DILocalVariable(name: "basic", scope: !315, file: !19, line: 184, type: !222)
!330 = !DILocation(line: 185, scope: !315)
!331 = !DILocation(line: 186, scope: !315)
!332 = !DILocation(line: 187, scope: !315)
!333 = !DILocation(line: 189, scope: !315)
!334 = !DILocation(line: 192, scope: !315)
!335 = !DILocation(line: 193, scope: !315)
!336 = !DILocalVariable(name: "str", scope: !315, file: !19, line: 193, type: !130)
!337 = !DILocation(line: 194, scope: !315)
!338 = !DILocation(line: 203, scope: !315)
!339 = !DILocation(line: 204, scope: !315)
!340 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 204, type: !149)
!341 = !DILocation(line: 205, scope: !315)
!342 = !DILocation(line: 207, scope: !315)
!343 = !DILocation(line: 208, scope: !315)
!344 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 208, type: !149)
!345 = !DILocation(line: 209, scope: !315)
!346 = !DILocation(line: 211, scope: !315)
!347 = !DILocation(line: 212, scope: !315)
!348 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 212, type: !149)
!349 = !DILocation(line: 213, scope: !315)
!350 = !DILocation(line: 215, scope: !315)
!351 = !DILocation(line: 216, scope: !315)
!352 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 216, type: !149)
!353 = !DILocation(line: 217, scope: !315)
!354 = !DILocation(line: 219, scope: !315)
!355 = !DILocation(line: 220, scope: !315)
!356 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 220, type: !126)
!357 = !DILocation(line: 221, scope: !315)
!358 = !DILocation(line: 223, scope: !315)
!359 = !DILocation(line: 224, scope: !315)
!360 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 224, type: !126)
!361 = !DILocation(line: 225, scope: !315)
!362 = !DILocation(line: 227, scope: !315)
!363 = !DILocation(line: 228, scope: !315)
!364 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 228, type: !126)
!365 = !DILocation(line: 229, scope: !315)
!366 = !DILocation(line: 231, scope: !315)
!367 = !DILocation(line: 232, scope: !315)
!368 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 232, type: !126)
!369 = !DILocation(line: 233, scope: !315)
!370 = !DILocation(line: 235, scope: !315)
!371 = !DILocation(line: 236, scope: !315)
!372 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 236, type: !126)
!373 = !DILocation(line: 237, scope: !315)
!374 = !DILocation(line: 239, scope: !315)
!375 = !DILocation(line: 240, scope: !315)
!376 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 240, type: !149)
!377 = !DILocation(line: 241, scope: !315)
!378 = !DILocation(line: 243, scope: !315)
!379 = !DILocation(line: 244, scope: !315)
!380 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 244, type: !381)
!381 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!382 = !DILocation(line: 245, scope: !315)
!383 = !DILocation(line: 247, scope: !315)
!384 = !DILocation(line: 248, scope: !315)
!385 = !DILocalVariable(name: "num", scope: !315, file: !19, line: 248, type: !386)
!386 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!387 = !DILocation(line: 249, scope: !315)
!388 = !DILocation(line: 251, scope: !315)
!389 = !DILocation(line: 252, scope: !315)
!390 = !DILocalVariable(name: "pt", scope: !315, file: !19, line: 252, type: !242)
!391 = !DILocation(line: 253, scope: !315)
!392 = !DILocalVariable(name: "info", scope: !315, file: !19, line: 253, type: !214)
!393 = !DILocation(line: 254, scope: !315)
!394 = !DILocation(line: 257, scope: !315)
!395 = !DILocation(line: 263, scope: !315)
!396 = !DILocalVariable(name: "st", scope: !315, file: !19, line: 263, type: !230)
!397 = !DILocation(line: 264, scope: !315)
!398 = !DILocation(line: 265, scope: !315)
!399 = !DILocation(line: 266, scope: !315)
!400 = !DILocalVariable(name: "n", scope: !315, file: !19, line: 266, type: !126)
!401 = !DILocation(line: 267, scope: !315)
!402 = !DILocalVariable(name: "m", scope: !315, file: !19, line: 267, type: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, name: "__init_StructMember", scope: !19, file: !19, size: 192, elements: !404)
!404 = !{!269, !405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !19, file: !19, baseType: !242, size: 64, align: 64, offset: 128)
!406 = !DILocation(line: 268, scope: !315)
!407 = !DILocation(line: 269, scope: !315)
!408 = !DILocation(line: 270, scope: !315)
!409 = !DILocation(line: 271, scope: !315)
!410 = !DILocalVariable(name: "ptr", scope: !315, file: !19, line: 271, type: !134)
!411 = !DILocation(line: 272, scope: !315)
!412 = !DILocalVariable(name: "offset", scope: !315, file: !19, line: 272, type: !126)
!413 = !DILocation(line: 273, scope: !315)
!414 = !DILocalVariable(name: "mem_arg", scope: !315, file: !19, line: 273, type: !318)
!415 = !DILocation(line: 277, scope: !315)
!416 = !DILocation(line: 279, scope: !315)
!417 = !DILocation(line: 280, scope: !315)
!418 = !DILocation(line: 281, scope: !315)
!419 = !DILocation(line: 284, scope: !315)
!420 = !DILocation(line: 299, scope: !315)
!421 = distinct !DISubprogram(name: "builder_to_string", linkageName: "__io_builder_to_string", scope: !19, file: !19, line: 301, type: !422, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !122}
!424 = !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !19, size: 128, align: 64, elements: !425)
!425 = !{!125, !426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !19, baseType: !134, size: 64, align: 64, offset: 64)
!427 = !DILocation(line: 301, scope: !421)
!428 = !DILocalVariable(name: "b_in", scope: !421, file: !19, line: 301, type: !122)
!429 = !DILocation(line: 302, scope: !421)
!430 = !DILocalVariable(name: "b", scope: !421, file: !19, line: 302, type: !122)
!431 = !DILocation(line: 303, scope: !421)
!432 = !DILocalVariable(name: "alloc", scope: !421, file: !19, line: 303, type: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !19, file: !19, size: 192, elements: !434)
!434 = !{!435, !441, !445}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !19, file: !19, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(int, *__mem_Allocator) -> ?*", baseType: !437, size: 64, align: 64, dwarfAddressSpace: 0)
!437 = !DISubroutineType(types: !438)
!438 = !{!321, !126, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__mem_Allocator", baseType: !440, size: 64, align: 64, dwarfAddressSpace: 0)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "__mem_Allocator", scope: !131, file: !131, size: 192, align: 64, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !19, file: !19, baseType: !442, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*fn(*, *__mem_Allocator)", baseType: !443, size: 64, align: 64, dwarfAddressSpace: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !321, !439}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !19, baseType: !321, size: 64, align: 64, offset: 128)
!446 = !DILocation(line: 304, scope: !421)
!447 = !DILocalVariable(name: "res", scope: !421, file: !19, line: 304, type: !424)
!448 = !DILocation(line: 306, scope: !421)
!449 = !DILocalVariable(name: "i", scope: !421, file: !19, line: 306, type: !126)
!450 = !DILocation(line: 307, scope: !421)
!451 = !DILocalVariable(name: "ptr", scope: !421, file: !19, line: 307, type: !134)
!452 = !DILocation(line: 308, scope: !421)
!453 = !DILocation(line: 309, scope: !421)
!454 = !DILocation(line: 310, scope: !421)
!455 = !DILocation(line: 313, scope: !421)
!456 = !DILocalVariable(name: "size", scope: !421, file: !19, line: 313, type: !126)
!457 = !DILocation(line: 314, scope: !421)
!458 = !DILocalVariable(name: "j", scope: !421, file: !19, line: 314, type: !126)
!459 = !DILocation(line: 315, scope: !421)
!460 = !DILocation(line: 319, scope: !421)
!461 = distinct !DISubprogram(name: "print_type_with_formatter", linkageName: "__io_print_type_with_formatter", scope: !19, file: !19, line: 322, type: !462, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !122, !129, !318}
!464 = !DILocation(line: 322, scope: !461)
!465 = !DILocalVariable(name: "b", scope: !461, file: !19, line: 322, type: !122)
!466 = !DILocalVariable(name: "c", arg: 1, scope: !461, file: !19, line: 322, type: !129)
!467 = !DILocalVariable(name: "arg", arg: 2, scope: !461, file: !19, line: 322, type: !318)
!468 = !DILocation(line: 323, scope: !461)
!469 = !DILocalVariable(name: "t", scope: !461, file: !19, line: 323, type: !214)
!470 = !DILocation(line: 324, scope: !461)
!471 = !DILocation(line: 325, scope: !461)
!472 = !DILocalVariable(name: "str", scope: !461, file: !19, line: 325, type: !134)
!473 = !DILocation(line: 326, scope: !461)
!474 = !DILocalVariable(name: "i", scope: !461, file: !19, line: 326, type: !126)
!475 = !DILocation(line: 327, scope: !461)
!476 = !DILocation(line: 330, scope: !461)
!477 = !DILocation(line: 331, scope: !461)
!478 = !DILocation(line: 333, scope: !461)
!479 = distinct !DISubprogram(name: "__internal_print", linkageName: "__io___internal_print", scope: !19, file: !19, line: 335, type: !480, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!480 = !DISubroutineType(types: !481)
!481 = !{!123, !130, !482}
!482 = !DICompositeType(tag: DW_TAG_structure_type, scope: !19, file: !19, size: 128, align: 64, elements: !483)
!483 = !{!125, !484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !19, file: !19, baseType: !485, size: 64, align: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__init_Arg", baseType: !318, size: 64, align: 64, dwarfAddressSpace: 0)
!486 = !DILocation(line: 335, scope: !479)
!487 = !DILocalVariable(name: "fmt", scope: !479, file: !19, line: 335, type: !130)
!488 = !DILocalVariable(name: "args", arg: 1, scope: !479, file: !19, line: 335, type: !482)
!489 = !DILocation(line: 336, scope: !479)
!490 = !DILocalVariable(name: "alloc", scope: !479, file: !19, line: 336, type: !433)
!491 = !DILocation(line: 337, scope: !479)
!492 = !DILocalVariable(name: "builder", scope: !479, file: !19, line: 337, type: !123)
!493 = !DILocation(line: 338, scope: !479)
!494 = !DILocalVariable(name: "arg_count", scope: !479, file: !19, line: 338, type: !126)
!495 = !DILocation(line: 339, scope: !479)
!496 = !DILocalVariable(name: "need_to_print_arg", scope: !479, file: !19, line: 339, type: !192)
!497 = !DILocation(line: 340, scope: !479)
!498 = !DILocalVariable(name: "c", scope: !479, file: !19, line: 340, type: !129)
!499 = !DILocalVariable(name: "i", scope: !479, file: !19, line: 340, type: !126)
!500 = !DILocation(line: 341, scope: !479)
!501 = !DILocation(line: 342, scope: !479)
!502 = !DILocation(line: 344, scope: !479)
!503 = !DILocation(line: 345, scope: !479)
!504 = !DILocalVariable(name: "arg", scope: !479, file: !19, line: 345, type: !318)
!505 = !DILocation(line: 346, scope: !479)
!506 = !DILocation(line: 347, scope: !479)
!507 = !DILocation(line: 348, scope: !479)
!508 = !DILocation(line: 350, scope: !479)
!509 = !DILocation(line: 355, scope: !479)
!510 = !DILocation(line: 356, scope: !479)
!511 = !DILocalVariable(name: "arg", scope: !479, file: !19, line: 356, type: !318)
!512 = !DILocation(line: 357, scope: !479)
!513 = !DILocation(line: 358, scope: !479)
!514 = !DILocation(line: 359, scope: !479)
!515 = !DILocation(line: 362, scope: !479)
!516 = distinct !DISubprogram(name: "print", linkageName: "__io_print", scope: !19, file: !19, line: 365, type: !517, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !130}
!519 = !DILocation(line: 365, scope: !516)
!520 = !DILocalVariable(name: "str", scope: !516, file: !19, line: 365, type: !130)
!521 = !DILocalVariable(name: "args", arg: 1, scope: !516, file: !19, line: 365, type: !482)
!522 = !DILocation(line: 366, scope: !516)
!523 = !DILocalVariable(name: "builder", scope: !516, file: !19, line: 366, type: !123)
!524 = !DILocation(line: 367, scope: !516)
!525 = !DILocalVariable(name: "res", scope: !516, file: !19, line: 367, type: !424)
!526 = !DILocation(line: 368, scope: !516)
!527 = !DILocation(line: 369, scope: !516)
!528 = !DILocation(line: 370, scope: !516)
!529 = !DILocation(line: 371, scope: !516)
!530 = distinct !DISubprogram(name: "println", linkageName: "__io_println", scope: !19, file: !19, line: 373, type: !517, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!531 = !DILocation(line: 373, scope: !530)
!532 = !DILocalVariable(name: "str", scope: !530, file: !19, line: 373, type: !130)
!533 = !DILocalVariable(name: "args", arg: 1, scope: !530, file: !19, line: 373, type: !482)
!534 = !DILocation(line: 374, scope: !530)
!535 = !DILocalVariable(name: "builder", scope: !530, file: !19, line: 374, type: !123)
!536 = !DILocation(line: 375, scope: !530)
!537 = !DILocation(line: 376, scope: !530)
!538 = !DILocalVariable(name: "res", scope: !530, file: !19, line: 376, type: !424)
!539 = !DILocation(line: 377, scope: !530)
!540 = !DILocation(line: 378, scope: !530)
!541 = !DILocation(line: 379, scope: !530)
!542 = !DILocation(line: 381, scope: !530)
!543 = distinct !DISubprogram(name: "readln", linkageName: "__io_readln", scope: !19, file: !19, line: 383, type: !544, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !137)
!544 = !DISubroutineType(types: !545)
!545 = !{!130, !439, !129}
