; ModuleID = 'main'
source_filename = "main.rcp"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%slice.23 = type { i64, ptr }
%slice.26 = type { i64, ptr }
%__init_Arg = type { i64, ptr }
%string = type { ptr, i64 }
%__renderer_ctx = type { i32, i32 }
%slice.22 = type { i64, ptr }
%__math_v2 = type { float, float }
%__sdl_Event = type { [128 x i8] }
%__math_v3 = type { float, float, float }
%__sdl_MouseMotionEvent = type { i32, i32, i64, i32, i32, i32, float, float, float, float }
%__sdl_MouseButtonEvent = type { i32, i32, i64, i32, i32, i8, i8, i8, i8, float, float }

$__main_WIDTH = comdat nodeduplicate

$__main_HEIGHT = comdat nodeduplicate

$__main_vert_shader = comdat nodeduplicate

$__main_frag_shader = comdat nodeduplicate

$___asan_gen__anon_global = comdat nodeduplicate

$___asan_gen__anon_global.22 = comdat nodeduplicate

$___asan_gen__anon_global.24 = comdat nodeduplicate

$___asan_gen__anon_global.26 = comdat nodeduplicate

$___asan_gen__anon_global.28 = comdat nodeduplicate

$___asan_gen__anon_global.30 = comdat nodeduplicate

$___asan_gen__anon_global.32 = comdat nodeduplicate

$___asan_gen__anon_global.34 = comdat nodeduplicate

$___asan_gen__anon_global.36 = comdat nodeduplicate

$___asan_gen__anon_global.38 = comdat nodeduplicate

$___asan_gen__anon_global.40 = comdat nodeduplicate

$___asan_gen__anon_global.42 = comdat nodeduplicate


!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_EventType", scope: !20, file: !20, size: 32, align: 32, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIEnumerator(name: "FIRST", value: 0)
!84 = !DIEnumerator(name: "QUIT", value: 256, isUnsigned: true)
!85 = !DIEnumerator(name: "MOUSE_MOTION", value: 1024, isUnsigned: true)
!86 = !DIEnumerator(name: "MOUSE_BUTTON_DOWN", value: 1025, isUnsigned: true)
!87 = !DIEnumerator(name: "MOUSE_BUTTON_UP", value: 1026, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__sdl_GLattr", scope: !20, file: !20, size: 32, align: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!90 = !DIEnumerator(name: "RED_SIZE", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "GREEN_SIZE", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "BLUE_SIZE", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "ALPHA_SIZE", value: 3, isUnsigned: true)
!94 = !DIEnumerator(name: "BUFFER_SIZE", value: 4, isUnsigned: true)
!95 = !DIEnumerator(name: "DOUBLEBUFFER", value: 5, isUnsigned: true)
!96 = !DIEnumerator(name: "DEPTH_SIZE", value: 6, isUnsigned: true)
!97 = !DIEnumerator(name: "STENCIL_SIZE", value: 7, isUnsigned: true)
!98 = !DIEnumerator(name: "ACCUM_RED_SIZE", value: 8, isUnsigned: true)
!99 = !DIEnumerator(name: "ACCUM_GREEN_SIZE", value: 9, isUnsigned: true)
!100 = !DIEnumerator(name: "ACCUM_BLUE_SIZE", value: 10, isUnsigned: true)
!101 = !DIEnumerator(name: "ACCUM_ALPHA_SIZE", value: 11, isUnsigned: true)
!102 = !DIEnumerator(name: "STEREO", value: 12, isUnsigned: true)
!103 = !DIEnumerator(name: "MULTISAMPLEBUFFERS", value: 13, isUnsigned: true)
!104 = !DIEnumerator(name: "MULTISAMPLESAMPLES", value: 14, isUnsigned: true)
!105 = !DIEnumerator(name: "ACCELERATED_VISUAL", value: 15, isUnsigned: true)
!106 = !DIEnumerator(name: "RETAINED_BACKING", value: 16, isUnsigned: true)
!107 = !DIEnumerator(name: "CONTEXT_MAJOR_VERSION", value: 17, isUnsigned: true)
!108 = !DIEnumerator(name: "CONTEXT_MINOR_VERSION", value: 18, isUnsigned: true)
!109 = !DIEnumerator(name: "CONTEXT_FLAGS", value: 19, isUnsigned: true)
!110 = !DIEnumerator(name: "CONTEXT_PROFILE_MASK", value: 20, isUnsigned: true)
!111 = !DIEnumerator(name: "SHARE_WITH_CURRENT_CONTEXT", value: 21, isUnsigned: true)
!112 = !DIEnumerator(name: "FRAMEBUFFER_SRGB_CAPABLE", value: 22, isUnsigned: true)
!113 = !DIEnumerator(name: "CONTEXT_RELEASE_BEHAVIOR", value: 23, isUnsigned: true)
!114 = !DIEnumerator(name: "CONTEXT_RESET_NOTIFICATION", value: 24, isUnsigned: true)
!115 = !DIEnumerator(name: "CONTEXT_NO_ERROR", value: 25, isUnsigned: true)
!116 = !DIEnumerator(name: "FLOATBUFFERS", value: 26, isUnsigned: true)
!117 = !DIEnumerator(name: "EGL_PLATFORM", value: 27, isUnsigned: true)
!118 = !{i32 2, !"CodeView", i32 1}
!119 = !{i32 2, !"Debug Info Version", i32 3}
!120 = distinct !DISubprogram(name: "main", linkageName: "__main_main", scope: !20, file: !20, line: 16, type: !121, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !124)
!121 = !DISubroutineType(types: !122)
!122 = !{!123}
!123 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!124 = !{}
!125 = !DILocation(line: 17, scope: !120)
!126 = !DILocation(line: 18, scope: !120)
!127 = !DILocation(line: 19, scope: !120)
!128 = !DILocation(line: 22, scope: !120)
!129 = !DILocalVariable(name: "n", scope: !120, file: !20, line: 22, type: !130)
!130 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!131 = !DILocation(line: 24, scope: !120)
!132 = !DILocation(line: 23, scope: !120)
!133 = !DILocation(line: 27, scope: !120)
!134 = !DILocation(line: 28, scope: !120)
!135 = !DILocation(line: 29, scope: !120)
!136 = !DILocation(line: 30, scope: !120)
!137 = !DILocation(line: 32, scope: !120)
!138 = !DILocalVariable(name: "maybe_window", scope: !120, file: !20, line: 32, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "?*__sdl_Window", baseType: !140, size: 64, align: 64, dwarfAddressSpace: 0)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sdl_Window", scope: !20, file: !20, elements: !124)
!141 = !DILocation(line: 33, scope: !120)
!142 = !DILocation(line: 34, scope: !120)
!143 = !DILocation(line: 35, scope: !120)
!144 = !DILocation(line: 38, scope: !120)
!145 = !DILocalVariable(name: "window", scope: !120, file: !20, line: 38, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__sdl_Window", baseType: !140, size: 64, align: 64, dwarfAddressSpace: 0)
!147 = !DILocation(line: 40, scope: !120)
!148 = !DILocalVariable(name: "maybe_ctx", scope: !120, file: !20, line: 40, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "?*__sdl_GLContext", baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sdl_GLContext", scope: !20, file: !20, elements: !124)
!151 = !DILocation(line: 41, scope: !120)
!152 = !DILocation(line: 42, scope: !120)
!153 = !DILocation(line: 43, scope: !120)
!154 = !DILocation(line: 46, scope: !120)
!155 = !DILocalVariable(name: "gl_ctx", scope: !120, file: !20, line: 46, type: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__sdl_GLContext", baseType: !150, size: 64, align: 64, dwarfAddressSpace: 0)
!157 = !DILocation(line: 48, scope: !120)
!158 = !DILocation(line: 49, scope: !120)
!159 = !DILocation(line: 50, scope: !120)
!160 = !DILocation(line: 53, scope: !120)
!161 = !DILocalVariable(name: "renderer", scope: !120, file: !20, line: 53, type: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "__renderer_ctx", scope: !20, file: !20, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "vao", scope: !20, file: !20, baseType: !165, size: 32, align: 32)
!165 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "vbo", scope: !20, file: !20, baseType: !165, size: 32, align: 32, offset: 32)
!167 = !DILocation(line: 54, scope: !120)
!168 = !DILocalVariable(name: "running", scope: !120, file: !20, line: 54, type: !169)
!169 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!170 = !DILocation(line: 56, scope: !120)
!171 = !DILocalVariable(name: "graph", scope: !120, file: !20, line: 56, type: !172)
!172 = !DICompositeType(tag: DW_TAG_structure_type, scope: !20, file: !20, size: 128, align: 64, elements: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !20, file: !20, baseType: !130, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !20, file: !20, baseType: !176, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*__math_v2", baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "__math_v2", scope: !20, file: !20, size: 64, elements: !178)
!178 = !{!179, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !20, baseType: !180, size: 32, align: 32)
!180 = !DIBasicType(name: "f32", size: 32, encoding: DW_ATE_float)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !20, baseType: !180, size: 32, align: 32, offset: 32)
!182 = !DILocation(line: 80, scope: !120)
!183 = !DILocation(line: 82, scope: !120)
!184 = !DILocalVariable(name: "mouse", scope: !120, file: !20, line: 82, type: !177)
!185 = !DILocation(line: 84, scope: !120)
!186 = !DILocalVariable(name: "program", scope: !120, file: !20, line: 84, type: !165)
!187 = !DILocation(line: 85, scope: !120)
!188 = !DILocation(line: 89, scope: !120)
!189 = !DILocation(line: 90, scope: !120)
!190 = !DILocalVariable(name: "t", scope: !120, file: !20, line: 90, type: !180)
!191 = !DILocation(line: 91, scope: !120)
!192 = !DILocalVariable(name: "lb_down", scope: !120, file: !20, line: 91, type: !169)
!193 = !DILocation(line: 92, scope: !120)
!194 = !DILocation(line: 93, scope: !120)
!195 = !DILocation(line: 94, scope: !120)
!196 = !DILocalVariable(name: "event", scope: !120, file: !20, line: 95, type: !197)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sdl_Event", scope: !20, file: !20, size: 1024, elements: !198)
!198 = !{!199, !200, !206, !216, !224}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !20, baseType: !81, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "quit", scope: !20, file: !20, baseType: !201, size: 128, align: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sdl_QuitEvent", scope: !20, file: !20, size: 128, elements: !202)
!202 = !{!199, !203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !20, file: !20, baseType: !165, size: 32, align: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !20, file: !20, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !20, file: !20, baseType: !207, size: 384, align: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sdl_MouseMotionEvent", scope: !20, file: !20, size: 384, elements: !208)
!208 = !{!199, !203, !204, !209, !210, !211, !212, !213, !214, !215}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "windowID", scope: !20, file: !20, baseType: !165, size: 32, align: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "which", scope: !20, file: !20, baseType: !165, size: 32, align: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !20, file: !20, baseType: !165, size: 32, align: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !20, baseType: !180, size: 32, align: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !20, baseType: !180, size: 32, align: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "xrel", scope: !20, file: !20, baseType: !180, size: 32, align: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "yrel", scope: !20, file: !20, baseType: !180, size: 32, align: 32, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !20, file: !20, baseType: !217, size: 320, align: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sdl_MouseButtonEvent", scope: !20, file: !20, size: 320, elements: !218)
!218 = !{!199, !203, !204, !209, !210, !219, !221, !222, !223, !212, !213}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !20, file: !20, baseType: !220, size: 8, align: 8, offset: 192)
!220 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !20, file: !20, baseType: !220, size: 8, align: 8, offset: 200)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "clicks", scope: !20, file: !20, baseType: !220, size: 8, align: 8, offset: 208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !20, file: !20, baseType: !220, size: 8, align: 8, offset: 216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !20, file: !20, baseType: !225, size: 1024, align: 8)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 1024, align: 8, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 128, lowerBound: 0)
!228 = !DILocation(line: 95, scope: !120)
!229 = !DILocation(line: 96, scope: !120)
!230 = !DILocation(line: 97, scope: !120)
!231 = !DILocation(line: 99, scope: !120)
!232 = !DILocation(line: 102, scope: !120)
!233 = !DILocation(line: 103, scope: !120)
!234 = !DILocation(line: 106, scope: !120)
!235 = !DILocation(line: 107, scope: !120)
!236 = !DILocation(line: 111, scope: !120)
!237 = !DILocation(line: 112, scope: !120)
!238 = !DILocation(line: 119, scope: !120)
!239 = !DILocation(line: 120, scope: !120)
!240 = !DILocation(line: 121, scope: !120)
!241 = !DILocation(line: 122, scope: !120)
!242 = !DILocation(line: 123, scope: !120)
!243 = !DILocation(line: 125, scope: !120)
!244 = !DILocalVariable(name: "DARK_F", scope: !120, file: !20, line: 125, type: !180)
!245 = !DILocation(line: 127, scope: !120)
!246 = !DILocation(line: 128, scope: !120)
!247 = !DILocation(line: 130, scope: !120)
!248 = !DILocation(line: 132, scope: !120)
!249 = !DILocation(line: 134, scope: !120)
!250 = !DILocation(line: 138, scope: !120)
